bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/aon_reg.h
/**
  ******************************************************************************
  * @file    aon_reg.h
  * @version V1.0
  * @date    2022-06-29
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __AON_REG_H__
#define  __AON_REG_H__

#include "bl702l.h"

/* 0x800 : aon */
#define AON_OFFSET                                              (0x800)
#define AON_RESV                                                AON_RESV
#define AON_RESV_POS                                            (0U)
#define AON_RESV_LEN                                            (8U)
#define AON_RESV_MSK                                            (((1U<<AON_RESV_LEN)-1)<<AON_RESV_POS)
#define AON_RESV_UMSK                                           (~(((1U<<AON_RESV_LEN)-1)<<AON_RESV_POS))
#define AON_PU_AON_DC_TBUF                                      AON_PU_AON_DC_TBUF
#define AON_PU_AON_DC_TBUF_POS                                  (12U)
#define AON_PU_AON_DC_TBUF_LEN                                  (1U)
#define AON_PU_AON_DC_TBUF_MSK                                  (((1U<<AON_PU_AON_DC_TBUF_LEN)-1)<<AON_PU_AON_DC_TBUF_POS)
#define AON_PU_AON_DC_TBUF_UMSK                                 (~(((1U<<AON_PU_AON_DC_TBUF_LEN)-1)<<AON_PU_AON_DC_TBUF_POS))
#define AON_LDO11_RT_PULLDOWN                                   AON_LDO11_RT_PULLDOWN
#define AON_LDO11_RT_PULLDOWN_POS                               (20U)
#define AON_LDO11_RT_PULLDOWN_LEN                               (1U)
#define AON_LDO11_RT_PULLDOWN_MSK                               (((1U<<AON_LDO11_RT_PULLDOWN_LEN)-1)<<AON_LDO11_RT_PULLDOWN_POS)
#define AON_LDO11_RT_PULLDOWN_UMSK                              (~(((1U<<AON_LDO11_RT_PULLDOWN_LEN)-1)<<AON_LDO11_RT_PULLDOWN_POS))
#define AON_LDO11_RT_PULLDOWN_SEL                               AON_LDO11_RT_PULLDOWN_SEL
#define AON_LDO11_RT_PULLDOWN_SEL_POS                           (21U)
#define AON_LDO11_RT_PULLDOWN_SEL_LEN                           (1U)
#define AON_LDO11_RT_PULLDOWN_SEL_MSK                           (((1U<<AON_LDO11_RT_PULLDOWN_SEL_LEN)-1)<<AON_LDO11_RT_PULLDOWN_SEL_POS)
#define AON_LDO11_RT_PULLDOWN_SEL_UMSK                          (~(((1U<<AON_LDO11_RT_PULLDOWN_SEL_LEN)-1)<<AON_LDO11_RT_PULLDOWN_SEL_POS))
#define AON_SW_PU_LDO11_RT                                      AON_SW_PU_LDO11_RT
#define AON_SW_PU_LDO11_RT_POS                                  (22U)
#define AON_SW_PU_LDO11_RT_LEN                                  (1U)
#define AON_SW_PU_LDO11_RT_MSK                                  (((1U<<AON_SW_PU_LDO11_RT_LEN)-1)<<AON_SW_PU_LDO11_RT_POS)
#define AON_SW_PU_LDO11_RT_UMSK                                 (~(((1U<<AON_SW_PU_LDO11_RT_LEN)-1)<<AON_SW_PU_LDO11_RT_POS))

/* 0x804 : aon_common */
#define AON_COMMON_OFFSET                                       (0x804)
#define AON_TMUX_AON                                            AON_TMUX_AON
#define AON_TMUX_AON_POS                                        (0U)
#define AON_TMUX_AON_LEN                                        (3U)
#define AON_TMUX_AON_MSK                                        (((1U<<AON_TMUX_AON_LEN)-1)<<AON_TMUX_AON_POS)
#define AON_TMUX_AON_UMSK                                       (~(((1U<<AON_TMUX_AON_LEN)-1)<<AON_TMUX_AON_POS))
#define AON_TEN_AON                                             AON_TEN_AON
#define AON_TEN_AON_POS                                         (4U)
#define AON_TEN_AON_LEN                                         (1U)
#define AON_TEN_AON_MSK                                         (((1U<<AON_TEN_AON_LEN)-1)<<AON_TEN_AON_POS)
#define AON_TEN_AON_UMSK                                        (~(((1U<<AON_TEN_AON_LEN)-1)<<AON_TEN_AON_POS))
#define AON_DTEN_XTAL32K                                        AON_DTEN_XTAL32K
#define AON_DTEN_XTAL32K_POS                                    (5U)
#define AON_DTEN_XTAL32K_LEN                                    (1U)
#define AON_DTEN_XTAL32K_MSK                                    (((1U<<AON_DTEN_XTAL32K_LEN)-1)<<AON_DTEN_XTAL32K_POS)
#define AON_DTEN_XTAL32K_UMSK                                   (~(((1U<<AON_DTEN_XTAL32K_LEN)-1)<<AON_DTEN_XTAL32K_POS))
#define AON_TEN_XTAL32K                                         AON_TEN_XTAL32K
#define AON_TEN_XTAL32K_POS                                     (6U)
#define AON_TEN_XTAL32K_LEN                                     (1U)
#define AON_TEN_XTAL32K_MSK                                     (((1U<<AON_TEN_XTAL32K_LEN)-1)<<AON_TEN_XTAL32K_POS)
#define AON_TEN_XTAL32K_UMSK                                    (~(((1U<<AON_TEN_XTAL32K_LEN)-1)<<AON_TEN_XTAL32K_POS))
#define AON_PMIP_DC_TP_OUT_EN_AON                               AON_PMIP_DC_TP_OUT_EN_AON
#define AON_PMIP_DC_TP_OUT_EN_AON_POS                           (7U)
#define AON_PMIP_DC_TP_OUT_EN_AON_LEN                           (1U)
#define AON_PMIP_DC_TP_OUT_EN_AON_MSK                           (((1U<<AON_PMIP_DC_TP_OUT_EN_AON_LEN)-1)<<AON_PMIP_DC_TP_OUT_EN_AON_POS)
#define AON_PMIP_DC_TP_OUT_EN_AON_UMSK                          (~(((1U<<AON_PMIP_DC_TP_OUT_EN_AON_LEN)-1)<<AON_PMIP_DC_TP_OUT_EN_AON_POS))
#define AON_TEN_LDO11SOC_AON                                    AON_TEN_LDO11SOC_AON
#define AON_TEN_LDO11SOC_AON_POS                                (9U)
#define AON_TEN_LDO11SOC_AON_LEN                                (1U)
#define AON_TEN_LDO11SOC_AON_MSK                                (((1U<<AON_TEN_LDO11SOC_AON_LEN)-1)<<AON_TEN_LDO11SOC_AON_POS)
#define AON_TEN_LDO11SOC_AON_UMSK                               (~(((1U<<AON_TEN_LDO11SOC_AON_LEN)-1)<<AON_TEN_LDO11SOC_AON_POS))
#define AON_TEN_DCDC_0_AON                                      AON_TEN_DCDC_0_AON
#define AON_TEN_DCDC_0_AON_POS                                  (10U)
#define AON_TEN_DCDC_0_AON_LEN                                  (1U)
#define AON_TEN_DCDC_0_AON_MSK                                  (((1U<<AON_TEN_DCDC_0_AON_LEN)-1)<<AON_TEN_DCDC_0_AON_POS)
#define AON_TEN_DCDC_0_AON_UMSK                                 (~(((1U<<AON_TEN_DCDC_0_AON_LEN)-1)<<AON_TEN_DCDC_0_AON_POS))
#define AON_TEN_DCDC_1_AON                                      AON_TEN_DCDC_1_AON
#define AON_TEN_DCDC_1_AON_POS                                  (11U)
#define AON_TEN_DCDC_1_AON_LEN                                  (1U)
#define AON_TEN_DCDC_1_AON_MSK                                  (((1U<<AON_TEN_DCDC_1_AON_LEN)-1)<<AON_TEN_DCDC_1_AON_POS)
#define AON_TEN_DCDC_1_AON_UMSK                                 (~(((1U<<AON_TEN_DCDC_1_AON_LEN)-1)<<AON_TEN_DCDC_1_AON_POS))
#define AON_TEN_BG_SYS_AON                                      AON_TEN_BG_SYS_AON
#define AON_TEN_BG_SYS_AON_POS                                  (12U)
#define AON_TEN_BG_SYS_AON_LEN                                  (1U)
#define AON_TEN_BG_SYS_AON_MSK                                  (((1U<<AON_TEN_BG_SYS_AON_LEN)-1)<<AON_TEN_BG_SYS_AON_POS)
#define AON_TEN_BG_SYS_AON_UMSK                                 (~(((1U<<AON_TEN_BG_SYS_AON_LEN)-1)<<AON_TEN_BG_SYS_AON_POS))
#define AON_TEN_LDO14_AON                                       AON_TEN_LDO14_AON
#define AON_TEN_LDO14_AON_POS                                   (13U)
#define AON_TEN_LDO14_AON_LEN                                   (1U)
#define AON_TEN_LDO14_AON_MSK                                   (((1U<<AON_TEN_LDO14_AON_LEN)-1)<<AON_TEN_LDO14_AON_POS)
#define AON_TEN_LDO14_AON_UMSK                                  (~(((1U<<AON_TEN_LDO14_AON_LEN)-1)<<AON_TEN_LDO14_AON_POS))
#define AON_TEN_XTAL_HF_RC32M_AON                               AON_TEN_XTAL_HF_RC32M_AON
#define AON_TEN_XTAL_HF_RC32M_AON_POS                           (16U)
#define AON_TEN_XTAL_HF_RC32M_AON_LEN                           (1U)
#define AON_TEN_XTAL_HF_RC32M_AON_MSK                           (((1U<<AON_TEN_XTAL_HF_RC32M_AON_LEN)-1)<<AON_TEN_XTAL_HF_RC32M_AON_POS)
#define AON_TEN_XTAL_HF_RC32M_AON_UMSK                          (~(((1U<<AON_TEN_XTAL_HF_RC32M_AON_LEN)-1)<<AON_TEN_XTAL_HF_RC32M_AON_POS))
#define AON_TEN_XTAL_AON                                        AON_TEN_XTAL_AON
#define AON_TEN_XTAL_AON_POS                                    (17U)
#define AON_TEN_XTAL_AON_LEN                                    (1U)
#define AON_TEN_XTAL_AON_MSK                                    (((1U<<AON_TEN_XTAL_AON_LEN)-1)<<AON_TEN_XTAL_AON_POS)
#define AON_TEN_XTAL_AON_UMSK                                   (~(((1U<<AON_TEN_XTAL_AON_LEN)-1)<<AON_TEN_XTAL_AON_POS))
#define AON_DTEN_XTAL_AON                                       AON_DTEN_XTAL_AON
#define AON_DTEN_XTAL_AON_POS                                   (18U)
#define AON_DTEN_XTAL_AON_LEN                                   (1U)
#define AON_DTEN_XTAL_AON_MSK                                   (((1U<<AON_DTEN_XTAL_AON_LEN)-1)<<AON_DTEN_XTAL_AON_POS)
#define AON_DTEN_XTAL_AON_UMSK                                  (~(((1U<<AON_DTEN_XTAL_AON_LEN)-1)<<AON_DTEN_XTAL_AON_POS))
#define AON_AVDD14_RDY_AON                                      AON_AVDD14_RDY_AON
#define AON_AVDD14_RDY_AON_POS                                  (31U)
#define AON_AVDD14_RDY_AON_LEN                                  (1U)
#define AON_AVDD14_RDY_AON_MSK                                  (((1U<<AON_AVDD14_RDY_AON_LEN)-1)<<AON_AVDD14_RDY_AON_POS)
#define AON_AVDD14_RDY_AON_UMSK                                 (~(((1U<<AON_AVDD14_RDY_AON_LEN)-1)<<AON_AVDD14_RDY_AON_POS))

/* 0x808 : aon_misc */
#define AON_MISC_OFFSET                                         (0x808)
#define AON_SW_SOC_EN_AON                                       AON_SW_SOC_EN_AON
#define AON_SW_SOC_EN_AON_POS                                   (0U)
#define AON_SW_SOC_EN_AON_LEN                                   (1U)
#define AON_SW_SOC_EN_AON_MSK                                   (((1U<<AON_SW_SOC_EN_AON_LEN)-1)<<AON_SW_SOC_EN_AON_POS)
#define AON_SW_SOC_EN_AON_UMSK                                  (~(((1U<<AON_SW_SOC_EN_AON_LEN)-1)<<AON_SW_SOC_EN_AON_POS))

