bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/aon_reg.h
/* 0x810 : bg_sys_top */
#define AON_BG_SYS_TOP_OFFSET                                   (0x810)
#define AON_PMIP_RESV_AON                                       AON_PMIP_RESV_AON
#define AON_PMIP_RESV_AON_POS                                   (0U)
#define AON_PMIP_RESV_AON_LEN                                   (8U)
#define AON_PMIP_RESV_AON_MSK                                   (((1U<<AON_PMIP_RESV_AON_LEN)-1)<<AON_PMIP_RESV_AON_POS)
#define AON_PMIP_RESV_AON_UMSK                                  (~(((1U<<AON_PMIP_RESV_AON_LEN)-1)<<AON_PMIP_RESV_AON_POS))
#define AON_PU_BG_SYS_AON                                       AON_PU_BG_SYS_AON
#define AON_PU_BG_SYS_AON_POS                                   (8U)
#define AON_PU_BG_SYS_AON_LEN                                   (1U)
#define AON_PU_BG_SYS_AON_MSK                                   (((1U<<AON_PU_BG_SYS_AON_LEN)-1)<<AON_PU_BG_SYS_AON_POS)
#define AON_PU_BG_SYS_AON_UMSK                                  (~(((1U<<AON_PU_BG_SYS_AON_LEN)-1)<<AON_PU_BG_SYS_AON_POS))
#define AON_BG_SYS_START_CTRL_AON                               AON_BG_SYS_START_CTRL_AON
#define AON_BG_SYS_START_CTRL_AON_POS                           (12U)
#define AON_BG_SYS_START_CTRL_AON_LEN                           (1U)
#define AON_BG_SYS_START_CTRL_AON_MSK                           (((1U<<AON_BG_SYS_START_CTRL_AON_LEN)-1)<<AON_BG_SYS_START_CTRL_AON_POS)
#define AON_BG_SYS_START_CTRL_AON_UMSK                          (~(((1U<<AON_BG_SYS_START_CTRL_AON_LEN)-1)<<AON_BG_SYS_START_CTRL_AON_POS))

/* 0x814 : dcdc18_top_0 */
#define AON_DCDC18_TOP_0_OFFSET                                 (0x814)
#define AON_DCDC_VOUT_SEL_AON                                   AON_DCDC_VOUT_SEL_AON
#define AON_DCDC_VOUT_SEL_AON_POS                               (1U)
#define AON_DCDC_VOUT_SEL_AON_LEN                               (5U)
#define AON_DCDC_VOUT_SEL_AON_MSK                               (((1U<<AON_DCDC_VOUT_SEL_AON_LEN)-1)<<AON_DCDC_VOUT_SEL_AON_POS)
#define AON_DCDC_VOUT_SEL_AON_UMSK                              (~(((1U<<AON_DCDC_VOUT_SEL_AON_LEN)-1)<<AON_DCDC_VOUT_SEL_AON_POS))
#define AON_DCDC_VPFM_AON                                       AON_DCDC_VPFM_AON
#define AON_DCDC_VPFM_AON_POS                                   (8U)
#define AON_DCDC_VPFM_AON_LEN                                   (4U)
#define AON_DCDC_VPFM_AON_MSK                                   (((1U<<AON_DCDC_VPFM_AON_LEN)-1)<<AON_DCDC_VPFM_AON_POS)
#define AON_DCDC_VPFM_AON_UMSK                                  (~(((1U<<AON_DCDC_VPFM_AON_LEN)-1)<<AON_DCDC_VPFM_AON_POS))
#define AON_DCDC_OSC_2M_MODE_AON                                AON_DCDC_OSC_2M_MODE_AON
#define AON_DCDC_OSC_2M_MODE_AON_POS                            (12U)
#define AON_DCDC_OSC_2M_MODE_AON_LEN                            (1U)
#define AON_DCDC_OSC_2M_MODE_AON_MSK                            (((1U<<AON_DCDC_OSC_2M_MODE_AON_LEN)-1)<<AON_DCDC_OSC_2M_MODE_AON_POS)
#define AON_DCDC_OSC_2M_MODE_AON_UMSK                           (~(((1U<<AON_DCDC_OSC_2M_MODE_AON_LEN)-1)<<AON_DCDC_OSC_2M_MODE_AON_POS))
#define AON_DCDC_OSC_FREQ_TRIM_AON                              AON_DCDC_OSC_FREQ_TRIM_AON
#define AON_DCDC_OSC_FREQ_TRIM_AON_POS                          (16U)
#define AON_DCDC_OSC_FREQ_TRIM_AON_LEN                          (4U)
#define AON_DCDC_OSC_FREQ_TRIM_AON_MSK                          (((1U<<AON_DCDC_OSC_FREQ_TRIM_AON_LEN)-1)<<AON_DCDC_OSC_FREQ_TRIM_AON_POS)
#define AON_DCDC_OSC_FREQ_TRIM_AON_UMSK                         (~(((1U<<AON_DCDC_OSC_FREQ_TRIM_AON_LEN)-1)<<AON_DCDC_OSC_FREQ_TRIM_AON_POS))
#define AON_DCDC_SLOPE_CURR_SEL_AON                             AON_DCDC_SLOPE_CURR_SEL_AON
#define AON_DCDC_SLOPE_CURR_SEL_AON_POS                         (20U)
#define AON_DCDC_SLOPE_CURR_SEL_AON_LEN                         (5U)
#define AON_DCDC_SLOPE_CURR_SEL_AON_MSK                         (((1U<<AON_DCDC_SLOPE_CURR_SEL_AON_LEN)-1)<<AON_DCDC_SLOPE_CURR_SEL_AON_POS)
#define AON_DCDC_SLOPE_CURR_SEL_AON_UMSK                        (~(((1U<<AON_DCDC_SLOPE_CURR_SEL_AON_LEN)-1)<<AON_DCDC_SLOPE_CURR_SEL_AON_POS))
#define AON_DCDC_EN_STOP_OSC_AON                                AON_DCDC_EN_STOP_OSC_AON
#define AON_DCDC_EN_STOP_OSC_AON_POS                            (25U)
#define AON_DCDC_EN_STOP_OSC_AON_LEN                            (1U)
#define AON_DCDC_EN_STOP_OSC_AON_MSK                            (((1U<<AON_DCDC_EN_STOP_OSC_AON_LEN)-1)<<AON_DCDC_EN_STOP_OSC_AON_POS)
#define AON_DCDC_EN_STOP_OSC_AON_UMSK                           (~(((1U<<AON_DCDC_EN_STOP_OSC_AON_LEN)-1)<<AON_DCDC_EN_STOP_OSC_AON_POS))
#define AON_DCDC_EN_SLOW_OSC_AON                                AON_DCDC_EN_SLOW_OSC_AON
#define AON_DCDC_EN_SLOW_OSC_AON_POS                            (26U)
#define AON_DCDC_EN_SLOW_OSC_AON_LEN                            (1U)
#define AON_DCDC_EN_SLOW_OSC_AON_MSK                            (((1U<<AON_DCDC_EN_SLOW_OSC_AON_LEN)-1)<<AON_DCDC_EN_SLOW_OSC_AON_POS)
#define AON_DCDC_EN_SLOW_OSC_AON_UMSK                           (~(((1U<<AON_DCDC_EN_SLOW_OSC_AON_LEN)-1)<<AON_DCDC_EN_SLOW_OSC_AON_POS))
#define AON_DCDC_OSC_INHIBIT_T2_AON                             AON_DCDC_OSC_INHIBIT_T2_AON
#define AON_DCDC_OSC_INHIBIT_T2_AON_POS                         (27U)
#define AON_DCDC_OSC_INHIBIT_T2_AON_LEN                         (1U)
#define AON_DCDC_OSC_INHIBIT_T2_AON_MSK                         (((1U<<AON_DCDC_OSC_INHIBIT_T2_AON_LEN)-1)<<AON_DCDC_OSC_INHIBIT_T2_AON_POS)
#define AON_DCDC_OSC_INHIBIT_T2_AON_UMSK                        (~(((1U<<AON_DCDC_OSC_INHIBIT_T2_AON_LEN)-1)<<AON_DCDC_OSC_INHIBIT_T2_AON_POS))
#define AON_DCDC_SSTART_TIME_AON                                AON_DCDC_SSTART_TIME_AON
#define AON_DCDC_SSTART_TIME_AON_POS                            (28U)
#define AON_DCDC_SSTART_TIME_AON_LEN                            (2U)
#define AON_DCDC_SSTART_TIME_AON_MSK                            (((1U<<AON_DCDC_SSTART_TIME_AON_LEN)-1)<<AON_DCDC_SSTART_TIME_AON_POS)
#define AON_DCDC_SSTART_TIME_AON_UMSK                           (~(((1U<<AON_DCDC_SSTART_TIME_AON_LEN)-1)<<AON_DCDC_SSTART_TIME_AON_POS))
#define AON_DCDC_DIS_AON                                        AON_DCDC_DIS_AON
#define AON_DCDC_DIS_AON_POS                                    (30U)
#define AON_DCDC_DIS_AON_LEN                                    (1U)
#define AON_DCDC_DIS_AON_MSK                                    (((1U<<AON_DCDC_DIS_AON_LEN)-1)<<AON_DCDC_DIS_AON_POS)
#define AON_DCDC_DIS_AON_UMSK                                   (~(((1U<<AON_DCDC_DIS_AON_LEN)-1)<<AON_DCDC_DIS_AON_POS))
#define AON_DCDC_RDY_AON                                        AON_DCDC_RDY_AON
#define AON_DCDC_RDY_AON_POS                                    (31U)
#define AON_DCDC_RDY_AON_LEN                                    (1U)
#define AON_DCDC_RDY_AON_MSK                                    (((1U<<AON_DCDC_RDY_AON_LEN)-1)<<AON_DCDC_RDY_AON_POS)
#define AON_DCDC_RDY_AON_UMSK                                   (~(((1U<<AON_DCDC_RDY_AON_LEN)-1)<<AON_DCDC_RDY_AON_POS))

/* 0x818 : dcdc18_top_1 */
#define AON_DCDC18_TOP_1_OFFSET                                 (0x818)
#define AON_DCDC_FORCE_EN_CS_ZVS_AON                            AON_DCDC_FORCE_EN_CS_ZVS_AON
#define AON_DCDC_FORCE_EN_CS_ZVS_AON_POS                        (0U)
#define AON_DCDC_FORCE_EN_CS_ZVS_AON_LEN                        (1U)
#define AON_DCDC_FORCE_EN_CS_ZVS_AON_MSK                        (((1U<<AON_DCDC_FORCE_EN_CS_ZVS_AON_LEN)-1)<<AON_DCDC_FORCE_EN_CS_ZVS_AON_POS)
#define AON_DCDC_FORCE_EN_CS_ZVS_AON_UMSK                       (~(((1U<<AON_DCDC_FORCE_EN_CS_ZVS_AON_LEN)-1)<<AON_DCDC_FORCE_EN_CS_ZVS_AON_POS))
#define AON_DCDC_CS_DELAY_AON                                   AON_DCDC_CS_DELAY_AON
#define AON_DCDC_CS_DELAY_AON_POS                               (1U)
#define AON_DCDC_CS_DELAY_AON_LEN                               (3U)
#define AON_DCDC_CS_DELAY_AON_MSK                               (((1U<<AON_DCDC_CS_DELAY_AON_LEN)-1)<<AON_DCDC_CS_DELAY_AON_POS)
#define AON_DCDC_CS_DELAY_AON_UMSK                              (~(((1U<<AON_DCDC_CS_DELAY_AON_LEN)-1)<<AON_DCDC_CS_DELAY_AON_POS))
#define AON_DCDC_ZVS_TD_OPT_AON                                 AON_DCDC_ZVS_TD_OPT_AON
#define AON_DCDC_ZVS_TD_OPT_AON_POS                             (4U)
#define AON_DCDC_ZVS_TD_OPT_AON_LEN                             (3U)
#define AON_DCDC_ZVS_TD_OPT_AON_MSK                             (((1U<<AON_DCDC_ZVS_TD_OPT_AON_LEN)-1)<<AON_DCDC_ZVS_TD_OPT_AON_POS)
#define AON_DCDC_ZVS_TD_OPT_AON_UMSK                            (~(((1U<<AON_DCDC_ZVS_TD_OPT_AON_LEN)-1)<<AON_DCDC_ZVS_TD_OPT_AON_POS))
#define AON_DCDC_NONOVERLAP_TD_AON                              AON_DCDC_NONOVERLAP_TD_AON
#define AON_DCDC_NONOVERLAP_TD_AON_POS                          (8U)
#define AON_DCDC_NONOVERLAP_TD_AON_LEN                          (5U)
#define AON_DCDC_NONOVERLAP_TD_AON_MSK                          (((1U<<AON_DCDC_NONOVERLAP_TD_AON_LEN)-1)<<AON_DCDC_NONOVERLAP_TD_AON_POS)
#define AON_DCDC_NONOVERLAP_TD_AON_UMSK                         (~(((1U<<AON_DCDC_NONOVERLAP_TD_AON_LEN)-1)<<AON_DCDC_NONOVERLAP_TD_AON_POS))
#define AON_DCDC_RC_SEL_AON                                     AON_DCDC_RC_SEL_AON
#define AON_DCDC_RC_SEL_AON_POS                                 (16U)
#define AON_DCDC_RC_SEL_AON_LEN                                 (4U)
#define AON_DCDC_RC_SEL_AON_MSK                                 (((1U<<AON_DCDC_RC_SEL_AON_LEN)-1)<<AON_DCDC_RC_SEL_AON_POS)
#define AON_DCDC_RC_SEL_AON_UMSK                                (~(((1U<<AON_DCDC_RC_SEL_AON_LEN)-1)<<AON_DCDC_RC_SEL_AON_POS))
#define AON_DCDC_CHF_SEL_AON                                    AON_DCDC_CHF_SEL_AON
#define AON_DCDC_CHF_SEL_AON_POS                                (20U)
#define AON_DCDC_CHF_SEL_AON_LEN                                (4U)
#define AON_DCDC_CHF_SEL_AON_MSK                                (((1U<<AON_DCDC_CHF_SEL_AON_LEN)-1)<<AON_DCDC_CHF_SEL_AON_POS)
#define AON_DCDC_CHF_SEL_AON_UMSK                               (~(((1U<<AON_DCDC_CHF_SEL_AON_LEN)-1)<<AON_DCDC_CHF_SEL_AON_POS))
#define AON_DCDC_CFB_SEL_AON                                    AON_DCDC_CFB_SEL_AON
#define AON_DCDC_CFB_SEL_AON_POS                                (24U)
#define AON_DCDC_CFB_SEL_AON_LEN                                (4U)
#define AON_DCDC_CFB_SEL_AON_MSK                                (((1U<<AON_DCDC_CFB_SEL_AON_LEN)-1)<<AON_DCDC_CFB_SEL_AON_POS)
#define AON_DCDC_CFB_SEL_AON_UMSK                               (~(((1U<<AON_DCDC_CFB_SEL_AON_LEN)-1)<<AON_DCDC_CFB_SEL_AON_POS))
#define AON_DCDC_EN_ANTIRING_AON                                AON_DCDC_EN_ANTIRING_AON
#define AON_DCDC_EN_ANTIRING_AON_POS                            (28U)
#define AON_DCDC_EN_ANTIRING_AON_LEN                            (1U)
#define AON_DCDC_EN_ANTIRING_AON_MSK                            (((1U<<AON_DCDC_EN_ANTIRING_AON_LEN)-1)<<AON_DCDC_EN_ANTIRING_AON_POS)
#define AON_DCDC_EN_ANTIRING_AON_UMSK                           (~(((1U<<AON_DCDC_EN_ANTIRING_AON_LEN)-1)<<AON_DCDC_EN_ANTIRING_AON_POS))
#define AON_DCDC_PULLDOWN_AON                                   AON_DCDC_PULLDOWN_AON
#define AON_DCDC_PULLDOWN_AON_POS                               (29U)
#define AON_DCDC_PULLDOWN_AON_LEN                               (1U)
#define AON_DCDC_PULLDOWN_AON_MSK                               (((1U<<AON_DCDC_PULLDOWN_AON_LEN)-1)<<AON_DCDC_PULLDOWN_AON_POS)
#define AON_DCDC_PULLDOWN_AON_UMSK                              (~(((1U<<AON_DCDC_PULLDOWN_AON_LEN)-1)<<AON_DCDC_PULLDOWN_AON_POS))

/* 0x81C : dcdc_top_2 */
#define AON_DCDC_TOP_2_OFFSET                                   (0x81C)
#define AON_DCDC_VOUT_TRIM_AON                                  AON_DCDC_VOUT_TRIM_AON
#define AON_DCDC_VOUT_TRIM_AON_POS                              (0U)
#define AON_DCDC_VOUT_TRIM_AON_LEN                              (4U)
#define AON_DCDC_VOUT_TRIM_AON_MSK                              (((1U<<AON_DCDC_VOUT_TRIM_AON_LEN)-1)<<AON_DCDC_VOUT_TRIM_AON_POS)
#define AON_DCDC_VOUT_TRIM_AON_UMSK                             (~(((1U<<AON_DCDC_VOUT_TRIM_AON_LEN)-1)<<AON_DCDC_VOUT_TRIM_AON_POS))
#define AON_DCDC_OSC_SS_RSTN_AON                                AON_DCDC_OSC_SS_RSTN_AON
#define AON_DCDC_OSC_SS_RSTN_AON_POS                            (4U)
#define AON_DCDC_OSC_SS_RSTN_AON_LEN                            (1U)
#define AON_DCDC_OSC_SS_RSTN_AON_MSK                            (((1U<<AON_DCDC_OSC_SS_RSTN_AON_LEN)-1)<<AON_DCDC_OSC_SS_RSTN_AON_POS)
#define AON_DCDC_OSC_SS_RSTN_AON_UMSK                           (~(((1U<<AON_DCDC_OSC_SS_RSTN_AON_LEN)-1)<<AON_DCDC_OSC_SS_RSTN_AON_POS))
#define AON_DCDC_OSC_SS_EN_AON                                  AON_DCDC_OSC_SS_EN_AON
#define AON_DCDC_OSC_SS_EN_AON_POS                              (5U)
#define AON_DCDC_OSC_SS_EN_AON_LEN                              (1U)
#define AON_DCDC_OSC_SS_EN_AON_MSK                              (((1U<<AON_DCDC_OSC_SS_EN_AON_LEN)-1)<<AON_DCDC_OSC_SS_EN_AON_POS)
#define AON_DCDC_OSC_SS_EN_AON_UMSK                             (~(((1U<<AON_DCDC_OSC_SS_EN_AON_LEN)-1)<<AON_DCDC_OSC_SS_EN_AON_POS))
#define AON_DCDC_OSC_SS_PERIOD_AON                              AON_DCDC_OSC_SS_PERIOD_AON
#define AON_DCDC_OSC_SS_PERIOD_AON_POS                          (8U)
#define AON_DCDC_OSC_SS_PERIOD_AON_LEN                          (2U)
#define AON_DCDC_OSC_SS_PERIOD_AON_MSK                          (((1U<<AON_DCDC_OSC_SS_PERIOD_AON_LEN)-1)<<AON_DCDC_OSC_SS_PERIOD_AON_POS)
#define AON_DCDC_OSC_SS_PERIOD_AON_UMSK                         (~(((1U<<AON_DCDC_OSC_SS_PERIOD_AON_LEN)-1)<<AON_DCDC_OSC_SS_PERIOD_AON_POS))
#define AON_DCDC_OSC_SS_FDEV_AON                                AON_DCDC_OSC_SS_FDEV_AON
#define AON_DCDC_OSC_SS_FDEV_AON_POS                            (10U)
#define AON_DCDC_OSC_SS_FDEV_AON_LEN                            (2U)
#define AON_DCDC_OSC_SS_FDEV_AON_MSK                            (((1U<<AON_DCDC_OSC_SS_FDEV_AON_LEN)-1)<<AON_DCDC_OSC_SS_FDEV_AON_POS)
#define AON_DCDC_OSC_SS_FDEV_AON_UMSK                           (~(((1U<<AON_DCDC_OSC_SS_FDEV_AON_LEN)-1)<<AON_DCDC_OSC_SS_FDEV_AON_POS))
#define AON_DCDC_COMP_GM_SEL_AON                                AON_DCDC_COMP_GM_SEL_AON
#define AON_DCDC_COMP_GM_SEL_AON_POS                            (12U)
#define AON_DCDC_COMP_GM_SEL_AON_LEN                            (3U)
#define AON_DCDC_COMP_GM_SEL_AON_MSK                            (((1U<<AON_DCDC_COMP_GM_SEL_AON_LEN)-1)<<AON_DCDC_COMP_GM_SEL_AON_POS)
#define AON_DCDC_COMP_GM_SEL_AON_UMSK                           (~(((1U<<AON_DCDC_COMP_GM_SEL_AON_LEN)-1)<<AON_DCDC_COMP_GM_SEL_AON_POS))
#define AON_DCDC_ISENSE_TRIM_AON                                AON_DCDC_ISENSE_TRIM_AON
#define AON_DCDC_ISENSE_TRIM_AON_POS                            (16U)
#define AON_DCDC_ISENSE_TRIM_AON_LEN                            (3U)
#define AON_DCDC_ISENSE_TRIM_AON_MSK                            (((1U<<AON_DCDC_ISENSE_TRIM_AON_LEN)-1)<<AON_DCDC_ISENSE_TRIM_AON_POS)
#define AON_DCDC_ISENSE_TRIM_AON_UMSK                           (~(((1U<<AON_DCDC_ISENSE_TRIM_AON_LEN)-1)<<AON_DCDC_ISENSE_TRIM_AON_POS))
#define AON_DCDC_VC_CLAMP_VTH_AON                               AON_DCDC_VC_CLAMP_VTH_AON
#define AON_DCDC_VC_CLAMP_VTH_AON_POS                           (20U)
#define AON_DCDC_VC_CLAMP_VTH_AON_LEN                           (3U)
#define AON_DCDC_VC_CLAMP_VTH_AON_MSK                           (((1U<<AON_DCDC_VC_CLAMP_VTH_AON_LEN)-1)<<AON_DCDC_VC_CLAMP_VTH_AON_POS)
#define AON_DCDC_VC_CLAMP_VTH_AON_UMSK                          (~(((1U<<AON_DCDC_VC_CLAMP_VTH_AON_LEN)-1)<<AON_DCDC_VC_CLAMP_VTH_AON_POS))
#define AON_DCDC_OCP_VTH_AON                                    AON_DCDC_OCP_VTH_AON
#define AON_DCDC_OCP_VTH_AON_POS                                (24U)
#define AON_DCDC_OCP_VTH_AON_LEN                                (3U)
#define AON_DCDC_OCP_VTH_AON_MSK                                (((1U<<AON_DCDC_OCP_VTH_AON_LEN)-1)<<AON_DCDC_OCP_VTH_AON_POS)
#define AON_DCDC_OCP_VTH_AON_UMSK                               (~(((1U<<AON_DCDC_OCP_VTH_AON_LEN)-1)<<AON_DCDC_OCP_VTH_AON_POS))
#define AON_DCDC_OCP_RST_AON                                    AON_DCDC_OCP_RST_AON
#define AON_DCDC_OCP_RST_AON_POS                                (27U)
#define AON_DCDC_OCP_RST_AON_LEN                                (1U)
#define AON_DCDC_OCP_RST_AON_MSK                                (((1U<<AON_DCDC_OCP_RST_AON_LEN)-1)<<AON_DCDC_OCP_RST_AON_POS)
#define AON_DCDC_OCP_RST_AON_UMSK                               (~(((1U<<AON_DCDC_OCP_RST_AON_LEN)-1)<<AON_DCDC_OCP_RST_AON_POS))
#define AON_DCDC_OCP_OUT_AON                                    AON_DCDC_OCP_OUT_AON
#define AON_DCDC_OCP_OUT_AON_POS                                (28U)
#define AON_DCDC_OCP_OUT_AON_LEN                                (1U)
#define AON_DCDC_OCP_OUT_AON_MSK                                (((1U<<AON_DCDC_OCP_OUT_AON_LEN)-1)<<AON_DCDC_OCP_OUT_AON_POS)
#define AON_DCDC_OCP_OUT_AON_UMSK                               (~(((1U<<AON_DCDC_OCP_OUT_AON_LEN)-1)<<AON_DCDC_OCP_OUT_AON_POS))
#define AON_DCDC_DRV_SR_AON                                     AON_DCDC_DRV_SR_AON
#define AON_DCDC_DRV_SR_AON_POS                                 (29U)
#define AON_DCDC_DRV_SR_AON_LEN                                 (2U)
#define AON_DCDC_DRV_SR_AON_MSK                                 (((1U<<AON_DCDC_DRV_SR_AON_LEN)-1)<<AON_DCDC_DRV_SR_AON_POS)
#define AON_DCDC_DRV_SR_AON_UMSK                                (~(((1U<<AON_DCDC_DRV_SR_AON_LEN)-1)<<AON_DCDC_DRV_SR_AON_POS))

/* 0x820 : ldo11soc_top */
#define AON_LDO11SOC_TOP_OFFSET                                 (0x820)
#define AON_LDO11SOC_VOUT_TRIM_AON                              AON_LDO11SOC_VOUT_TRIM_AON
#define AON_LDO11SOC_VOUT_TRIM_AON_POS                          (0U)
#define AON_LDO11SOC_VOUT_TRIM_AON_LEN                          (4U)
#define AON_LDO11SOC_VOUT_TRIM_AON_MSK                          (((1U<<AON_LDO11SOC_VOUT_TRIM_AON_LEN)-1)<<AON_LDO11SOC_VOUT_TRIM_AON_POS)
#define AON_LDO11SOC_VOUT_TRIM_AON_UMSK                         (~(((1U<<AON_LDO11SOC_VOUT_TRIM_AON_LEN)-1)<<AON_LDO11SOC_VOUT_TRIM_AON_POS))
#define AON_PU_LDO11SOC_AON                                     AON_PU_LDO11SOC_AON
#define AON_PU_LDO11SOC_AON_POS                                 (4U)
#define AON_PU_LDO11SOC_AON_LEN                                 (1U)
#define AON_PU_LDO11SOC_AON_MSK                                 (((1U<<AON_PU_LDO11SOC_AON_LEN)-1)<<AON_PU_LDO11SOC_AON_POS)
#define AON_PU_LDO11SOC_AON_UMSK                                (~(((1U<<AON_PU_LDO11SOC_AON_LEN)-1)<<AON_PU_LDO11SOC_AON_POS))
#define AON_LDO11SOC_SSTART_SEL_AON                             AON_LDO11SOC_SSTART_SEL_AON
#define AON_LDO11SOC_SSTART_SEL_AON_POS                         (5U)
#define AON_LDO11SOC_SSTART_SEL_AON_LEN                         (1U)
#define AON_LDO11SOC_SSTART_SEL_AON_MSK                         (((1U<<AON_LDO11SOC_SSTART_SEL_AON_LEN)-1)<<AON_LDO11SOC_SSTART_SEL_AON_POS)
#define AON_LDO11SOC_SSTART_SEL_AON_UMSK                        (~(((1U<<AON_LDO11SOC_SSTART_SEL_AON_LEN)-1)<<AON_LDO11SOC_SSTART_SEL_AON_POS))
#define AON_LDO11SOC_SSTART_DELAY_AON                           AON_LDO11SOC_SSTART_DELAY_AON
#define AON_LDO11SOC_SSTART_DELAY_AON_POS                       (8U)
#define AON_LDO11SOC_SSTART_DELAY_AON_LEN                       (2U)
#define AON_LDO11SOC_SSTART_DELAY_AON_MSK                       (((1U<<AON_LDO11SOC_SSTART_DELAY_AON_LEN)-1)<<AON_LDO11SOC_SSTART_DELAY_AON_POS)
#define AON_LDO11SOC_SSTART_DELAY_AON_UMSK                      (~(((1U<<AON_LDO11SOC_SSTART_DELAY_AON_LEN)-1)<<AON_LDO11SOC_SSTART_DELAY_AON_POS))
#define AON_LDO11SOC_PULLDOWN_AON                               AON_LDO11SOC_PULLDOWN_AON
#define AON_LDO11SOC_PULLDOWN_AON_POS                           (10U)
#define AON_LDO11SOC_PULLDOWN_AON_LEN                           (1U)
#define AON_LDO11SOC_PULLDOWN_AON_MSK                           (((1U<<AON_LDO11SOC_PULLDOWN_AON_LEN)-1)<<AON_LDO11SOC_PULLDOWN_AON_POS)
#define AON_LDO11SOC_PULLDOWN_AON_UMSK                          (~(((1U<<AON_LDO11SOC_PULLDOWN_AON_LEN)-1)<<AON_LDO11SOC_PULLDOWN_AON_POS))
#define AON_LDO11SOC_PULLDOWN_SEL_AON                           AON_LDO11SOC_PULLDOWN_SEL_AON
#define AON_LDO11SOC_PULLDOWN_SEL_AON_POS                       (11U)
#define AON_LDO11SOC_PULLDOWN_SEL_AON_LEN                       (1U)
#define AON_LDO11SOC_PULLDOWN_SEL_AON_MSK                       (((1U<<AON_LDO11SOC_PULLDOWN_SEL_AON_LEN)-1)<<AON_LDO11SOC_PULLDOWN_SEL_AON_POS)
#define AON_LDO11SOC_PULLDOWN_SEL_AON_UMSK                      (~(((1U<<AON_LDO11SOC_PULLDOWN_SEL_AON_LEN)-1)<<AON_LDO11SOC_PULLDOWN_SEL_AON_POS))
#define AON_LDO11SOC_VTH_SEL_AON                                AON_LDO11SOC_VTH_SEL_AON
#define AON_LDO11SOC_VTH_SEL_AON_POS                            (12U)
#define AON_LDO11SOC_VTH_SEL_AON_LEN                            (2U)
#define AON_LDO11SOC_VTH_SEL_AON_MSK                            (((1U<<AON_LDO11SOC_VTH_SEL_AON_LEN)-1)<<AON_LDO11SOC_VTH_SEL_AON_POS)
#define AON_LDO11SOC_VTH_SEL_AON_UMSK                           (~(((1U<<AON_LDO11SOC_VTH_SEL_AON_LEN)-1)<<AON_LDO11SOC_VTH_SEL_AON_POS))
#define AON_LDO11SOC_CC_AON                                     AON_LDO11SOC_CC_AON
#define AON_LDO11SOC_CC_AON_POS                                 (24U)
#define AON_LDO11SOC_CC_AON_LEN                                 (2U)
#define AON_LDO11SOC_CC_AON_MSK                                 (((1U<<AON_LDO11SOC_CC_AON_LEN)-1)<<AON_LDO11SOC_CC_AON_POS)
#define AON_LDO11SOC_CC_AON_UMSK                                (~(((1U<<AON_LDO11SOC_CC_AON_LEN)-1)<<AON_LDO11SOC_CC_AON_POS))
#define AON_LDO11SOC_RDY_AON                                    AON_LDO11SOC_RDY_AON
#define AON_LDO11SOC_RDY_AON_POS                                (28U)
#define AON_LDO11SOC_RDY_AON_LEN                                (1U)
#define AON_LDO11SOC_RDY_AON_MSK                                (((1U<<AON_LDO11SOC_RDY_AON_LEN)-1)<<AON_LDO11SOC_RDY_AON_POS)
#define AON_LDO11SOC_RDY_AON_UMSK                               (~(((1U<<AON_LDO11SOC_RDY_AON_LEN)-1)<<AON_LDO11SOC_RDY_AON_POS))
#define AON_LDO11SOC_POWER_GOOD_AON                             AON_LDO11SOC_POWER_GOOD_AON
#define AON_LDO11SOC_POWER_GOOD_AON_POS                         (29U)
#define AON_LDO11SOC_POWER_GOOD_AON_LEN                         (1U)
#define AON_LDO11SOC_POWER_GOOD_AON_MSK                         (((1U<<AON_LDO11SOC_POWER_GOOD_AON_LEN)-1)<<AON_LDO11SOC_POWER_GOOD_AON_POS)
#define AON_LDO11SOC_POWER_GOOD_AON_UMSK                        (~(((1U<<AON_LDO11SOC_POWER_GOOD_AON_LEN)-1)<<AON_LDO11SOC_POWER_GOOD_AON_POS))

