bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/aon_reg.h
/* 0x824 : ldo14_top */
#define AON_LDO14_TOP_OFFSET                                    (0x824)
#define AON_LDO14_OCP_TH_AON                                    AON_LDO14_OCP_TH_AON
#define AON_LDO14_OCP_TH_AON_POS                                (1U)
#define AON_LDO14_OCP_TH_AON_LEN                                (3U)
#define AON_LDO14_OCP_TH_AON_MSK                                (((1U<<AON_LDO14_OCP_TH_AON_LEN)-1)<<AON_LDO14_OCP_TH_AON_POS)
#define AON_LDO14_OCP_TH_AON_UMSK                               (~(((1U<<AON_LDO14_OCP_TH_AON_LEN)-1)<<AON_LDO14_OCP_TH_AON_POS))
#define AON_LDO14_OCP_EN_AON                                    AON_LDO14_OCP_EN_AON
#define AON_LDO14_OCP_EN_AON_POS                                (4U)
#define AON_LDO14_OCP_EN_AON_LEN                                (1U)
#define AON_LDO14_OCP_EN_AON_MSK                                (((1U<<AON_LDO14_OCP_EN_AON_LEN)-1)<<AON_LDO14_OCP_EN_AON_POS)
#define AON_LDO14_OCP_EN_AON_UMSK                               (~(((1U<<AON_LDO14_OCP_EN_AON_LEN)-1)<<AON_LDO14_OCP_EN_AON_POS))
#define AON_LDO14_OCP_OUT_AON                                   AON_LDO14_OCP_OUT_AON
#define AON_LDO14_OCP_OUT_AON_POS                               (5U)
#define AON_LDO14_OCP_OUT_AON_LEN                               (1U)
#define AON_LDO14_OCP_OUT_AON_MSK                               (((1U<<AON_LDO14_OCP_OUT_AON_LEN)-1)<<AON_LDO14_OCP_OUT_AON_POS)
#define AON_LDO14_OCP_OUT_AON_UMSK                              (~(((1U<<AON_LDO14_OCP_OUT_AON_LEN)-1)<<AON_LDO14_OCP_OUT_AON_POS))
#define AON_LDO14_BM_AON                                        AON_LDO14_BM_AON
#define AON_LDO14_BM_AON_POS                                    (6U)
#define AON_LDO14_BM_AON_LEN                                    (2U)
#define AON_LDO14_BM_AON_MSK                                    (((1U<<AON_LDO14_BM_AON_LEN)-1)<<AON_LDO14_BM_AON_POS)
#define AON_LDO14_BM_AON_UMSK                                   (~(((1U<<AON_LDO14_BM_AON_LEN)-1)<<AON_LDO14_BM_AON_POS))
#define AON_LDO14_SSTART_SEL_AON                                AON_LDO14_SSTART_SEL_AON
#define AON_LDO14_SSTART_SEL_AON_POS                            (8U)
#define AON_LDO14_SSTART_SEL_AON_LEN                            (1U)
#define AON_LDO14_SSTART_SEL_AON_MSK                            (((1U<<AON_LDO14_SSTART_SEL_AON_LEN)-1)<<AON_LDO14_SSTART_SEL_AON_POS)
#define AON_LDO14_SSTART_SEL_AON_UMSK                           (~(((1U<<AON_LDO14_SSTART_SEL_AON_LEN)-1)<<AON_LDO14_SSTART_SEL_AON_POS))
#define AON_LDO14_SSTART_DELAY_AON                              AON_LDO14_SSTART_DELAY_AON
#define AON_LDO14_SSTART_DELAY_AON_POS                          (9U)
#define AON_LDO14_SSTART_DELAY_AON_LEN                          (2U)
#define AON_LDO14_SSTART_DELAY_AON_MSK                          (((1U<<AON_LDO14_SSTART_DELAY_AON_LEN)-1)<<AON_LDO14_SSTART_DELAY_AON_POS)
#define AON_LDO14_SSTART_DELAY_AON_UMSK                         (~(((1U<<AON_LDO14_SSTART_DELAY_AON_LEN)-1)<<AON_LDO14_SSTART_DELAY_AON_POS))
#define AON_LDO14_RDY_AON                                       AON_LDO14_RDY_AON
#define AON_LDO14_RDY_AON_POS                                   (11U)
#define AON_LDO14_RDY_AON_LEN                                   (1U)
#define AON_LDO14_RDY_AON_MSK                                   (((1U<<AON_LDO14_RDY_AON_LEN)-1)<<AON_LDO14_RDY_AON_POS)
#define AON_LDO14_RDY_AON_UMSK                                  (~(((1U<<AON_LDO14_RDY_AON_LEN)-1)<<AON_LDO14_RDY_AON_POS))
#define AON_LDO14_PULLDOWN_AON                                  AON_LDO14_PULLDOWN_AON
#define AON_LDO14_PULLDOWN_AON_POS                              (12U)
#define AON_LDO14_PULLDOWN_AON_LEN                              (1U)
#define AON_LDO14_PULLDOWN_AON_MSK                              (((1U<<AON_LDO14_PULLDOWN_AON_LEN)-1)<<AON_LDO14_PULLDOWN_AON_POS)
#define AON_LDO14_PULLDOWN_AON_UMSK                             (~(((1U<<AON_LDO14_PULLDOWN_AON_LEN)-1)<<AON_LDO14_PULLDOWN_AON_POS))
#define AON_LDO14_PULLDOWN_SEL_AON                              AON_LDO14_PULLDOWN_SEL_AON
#define AON_LDO14_PULLDOWN_SEL_AON_POS                          (13U)
#define AON_LDO14_PULLDOWN_SEL_AON_LEN                          (1U)
#define AON_LDO14_PULLDOWN_SEL_AON_MSK                          (((1U<<AON_LDO14_PULLDOWN_SEL_AON_LEN)-1)<<AON_LDO14_PULLDOWN_SEL_AON_POS)
#define AON_LDO14_PULLDOWN_SEL_AON_UMSK                         (~(((1U<<AON_LDO14_PULLDOWN_SEL_AON_LEN)-1)<<AON_LDO14_PULLDOWN_SEL_AON_POS))
#define AON_LDO14_VOUT_SEL_AON                                  AON_LDO14_VOUT_SEL_AON
#define AON_LDO14_VOUT_SEL_AON_POS                              (16U)
#define AON_LDO14_VOUT_SEL_AON_LEN                              (3U)
#define AON_LDO14_VOUT_SEL_AON_MSK                              (((1U<<AON_LDO14_VOUT_SEL_AON_LEN)-1)<<AON_LDO14_VOUT_SEL_AON_POS)
#define AON_LDO14_VOUT_SEL_AON_UMSK                             (~(((1U<<AON_LDO14_VOUT_SEL_AON_LEN)-1)<<AON_LDO14_VOUT_SEL_AON_POS))
#define AON_LDO14_CC_AON                                        AON_LDO14_CC_AON
#define AON_LDO14_CC_AON_POS                                    (24U)
#define AON_LDO14_CC_AON_LEN                                    (2U)
#define AON_LDO14_CC_AON_MSK                                    (((1U<<AON_LDO14_CC_AON_LEN)-1)<<AON_LDO14_CC_AON_POS)
#define AON_LDO14_CC_AON_UMSK                                   (~(((1U<<AON_LDO14_CC_AON_LEN)-1)<<AON_LDO14_CC_AON_POS))
#define AON_LDO14_BYPASS_AON                                    AON_LDO14_BYPASS_AON
#define AON_LDO14_BYPASS_AON_POS                                (27U)
#define AON_LDO14_BYPASS_AON_LEN                                (1U)
#define AON_LDO14_BYPASS_AON_MSK                                (((1U<<AON_LDO14_BYPASS_AON_LEN)-1)<<AON_LDO14_BYPASS_AON_POS)
#define AON_LDO14_BYPASS_AON_UMSK                               (~(((1U<<AON_LDO14_BYPASS_AON_LEN)-1)<<AON_LDO14_BYPASS_AON_POS))
#define AON_LDO14_VOUT_TRIM_AON                                 AON_LDO14_VOUT_TRIM_AON
#define AON_LDO14_VOUT_TRIM_AON_POS                             (28U)
#define AON_LDO14_VOUT_TRIM_AON_LEN                             (4U)
#define AON_LDO14_VOUT_TRIM_AON_MSK                             (((1U<<AON_LDO14_VOUT_TRIM_AON_LEN)-1)<<AON_LDO14_VOUT_TRIM_AON_POS)
#define AON_LDO14_VOUT_TRIM_AON_UMSK                            (~(((1U<<AON_LDO14_VOUT_TRIM_AON_LEN)-1)<<AON_LDO14_VOUT_TRIM_AON_POS))

/* 0x828 : psw_irrcv */
#define AON_PSW_IRRCV_OFFSET                                    (0x828)
#define AON_PU_IR_PSW_AON                                       AON_PU_IR_PSW_AON
#define AON_PU_IR_PSW_AON_POS                                   (0U)
#define AON_PU_IR_PSW_AON_LEN                                   (1U)
#define AON_PU_IR_PSW_AON_MSK                                   (((1U<<AON_PU_IR_PSW_AON_LEN)-1)<<AON_PU_IR_PSW_AON_POS)
#define AON_PU_IR_PSW_AON_UMSK                                  (~(((1U<<AON_PU_IR_PSW_AON_LEN)-1)<<AON_PU_IR_PSW_AON_POS))

/* 0x880 : rf_top_aon */
#define AON_RF_TOP_AON_OFFSET                                   (0x880)
#define AON_PU_MBG_AON                                          AON_PU_MBG_AON
#define AON_PU_MBG_AON_POS                                      (0U)
#define AON_PU_MBG_AON_LEN                                      (1U)
#define AON_PU_MBG_AON_MSK                                      (((1U<<AON_PU_MBG_AON_LEN)-1)<<AON_PU_MBG_AON_POS)
#define AON_PU_MBG_AON_UMSK                                     (~(((1U<<AON_PU_MBG_AON_LEN)-1)<<AON_PU_MBG_AON_POS))
#define AON_SW_BZ_EN_AON                                        AON_SW_BZ_EN_AON
#define AON_SW_BZ_EN_AON_POS                                    (1U)
#define AON_SW_BZ_EN_AON_LEN                                    (1U)
#define AON_SW_BZ_EN_AON_MSK                                    (((1U<<AON_SW_BZ_EN_AON_LEN)-1)<<AON_SW_BZ_EN_AON_POS)
#define AON_SW_BZ_EN_AON_UMSK                                   (~(((1U<<AON_SW_BZ_EN_AON_LEN)-1)<<AON_SW_BZ_EN_AON_POS))
#define AON_PU_SFREG_AON                                        AON_PU_SFREG_AON
#define AON_PU_SFREG_AON_POS                                    (2U)
#define AON_PU_SFREG_AON_LEN                                    (1U)
#define AON_PU_SFREG_AON_MSK                                    (((1U<<AON_PU_SFREG_AON_LEN)-1)<<AON_PU_SFREG_AON_POS)
#define AON_PU_SFREG_AON_UMSK                                   (~(((1U<<AON_PU_SFREG_AON_LEN)-1)<<AON_PU_SFREG_AON_POS))
#define AON_PUD_XTAL_AON                                        AON_PUD_XTAL_AON
#define AON_PUD_XTAL_AON_POS                                    (3U)
#define AON_PUD_XTAL_AON_LEN                                    (1U)
#define AON_PUD_XTAL_AON_MSK                                    (((1U<<AON_PUD_XTAL_AON_LEN)-1)<<AON_PUD_XTAL_AON_POS)
#define AON_PUD_XTAL_AON_UMSK                                   (~(((1U<<AON_PUD_XTAL_AON_LEN)-1)<<AON_PUD_XTAL_AON_POS))
#define AON_PU_XTAL_AON                                         AON_PU_XTAL_AON
#define AON_PU_XTAL_AON_POS                                     (5U)
#define AON_PU_XTAL_AON_LEN                                     (1U)
#define AON_PU_XTAL_AON_MSK                                     (((1U<<AON_PU_XTAL_AON_LEN)-1)<<AON_PU_XTAL_AON_POS)
#define AON_PU_XTAL_AON_UMSK                                    (~(((1U<<AON_PU_XTAL_AON_LEN)-1)<<AON_PU_XTAL_AON_POS))
#define AON_PU_XTAL_HF_RC32M_AON                                AON_PU_XTAL_HF_RC32M_AON
#define AON_PU_XTAL_HF_RC32M_AON_POS                            (6U)
#define AON_PU_XTAL_HF_RC32M_AON_LEN                            (1U)
#define AON_PU_XTAL_HF_RC32M_AON_MSK                            (((1U<<AON_PU_XTAL_HF_RC32M_AON_LEN)-1)<<AON_PU_XTAL_HF_RC32M_AON_POS)
#define AON_PU_XTAL_HF_RC32M_AON_UMSK                           (~(((1U<<AON_PU_XTAL_HF_RC32M_AON_LEN)-1)<<AON_PU_XTAL_HF_RC32M_AON_POS))
#define AON_PUD_XTAL_HF_RC32M_AON                               AON_PUD_XTAL_HF_RC32M_AON
#define AON_PUD_XTAL_HF_RC32M_AON_POS                           (7U)
#define AON_PUD_XTAL_HF_RC32M_AON_LEN                           (1U)
#define AON_PUD_XTAL_HF_RC32M_AON_MSK                           (((1U<<AON_PUD_XTAL_HF_RC32M_AON_LEN)-1)<<AON_PUD_XTAL_HF_RC32M_AON_POS)
#define AON_PUD_XTAL_HF_RC32M_AON_UMSK                          (~(((1U<<AON_PUD_XTAL_HF_RC32M_AON_LEN)-1)<<AON_PUD_XTAL_HF_RC32M_AON_POS))

