bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/aon_reg.h
/* 0x884 : xtal_cfg */
#define AON_XTAL_CFG_OFFSET                                     (0x884)
#define AON_XTAL_BK_AON                                         AON_XTAL_BK_AON
#define AON_XTAL_BK_AON_POS                                     (0U)
#define AON_XTAL_BK_AON_LEN                                     (2U)
#define AON_XTAL_BK_AON_MSK                                     (((1U<<AON_XTAL_BK_AON_LEN)-1)<<AON_XTAL_BK_AON_POS)
#define AON_XTAL_BK_AON_UMSK                                    (~(((1U<<AON_XTAL_BK_AON_LEN)-1)<<AON_XTAL_BK_AON_POS))
#define AON_XTAL_CAPCODE_EXTRA_AON                              AON_XTAL_CAPCODE_EXTRA_AON
#define AON_XTAL_CAPCODE_EXTRA_AON_POS                          (2U)
#define AON_XTAL_CAPCODE_EXTRA_AON_LEN                          (1U)
#define AON_XTAL_CAPCODE_EXTRA_AON_MSK                          (((1U<<AON_XTAL_CAPCODE_EXTRA_AON_LEN)-1)<<AON_XTAL_CAPCODE_EXTRA_AON_POS)
#define AON_XTAL_CAPCODE_EXTRA_AON_UMSK                         (~(((1U<<AON_XTAL_CAPCODE_EXTRA_AON_LEN)-1)<<AON_XTAL_CAPCODE_EXTRA_AON_POS))
#define AON_XTAL_EXT_SEL_AON                                    AON_XTAL_EXT_SEL_AON
#define AON_XTAL_EXT_SEL_AON_POS                                (3U)
#define AON_XTAL_EXT_SEL_AON_LEN                                (1U)
#define AON_XTAL_EXT_SEL_AON_MSK                                (((1U<<AON_XTAL_EXT_SEL_AON_LEN)-1)<<AON_XTAL_EXT_SEL_AON_POS)
#define AON_XTAL_EXT_SEL_AON_UMSK                               (~(((1U<<AON_XTAL_EXT_SEL_AON_LEN)-1)<<AON_XTAL_EXT_SEL_AON_POS))
#define AON_XTAL_BUF_EN_AON                                     AON_XTAL_BUF_EN_AON
#define AON_XTAL_BUF_EN_AON_POS                                 (4U)
#define AON_XTAL_BUF_EN_AON_LEN                                 (4U)
#define AON_XTAL_BUF_EN_AON_MSK                                 (((1U<<AON_XTAL_BUF_EN_AON_LEN)-1)<<AON_XTAL_BUF_EN_AON_POS)
#define AON_XTAL_BUF_EN_AON_UMSK                                (~(((1U<<AON_XTAL_BUF_EN_AON_LEN)-1)<<AON_XTAL_BUF_EN_AON_POS))
#define AON_XTAL_BUF_HP_AON                                     AON_XTAL_BUF_HP_AON
#define AON_XTAL_BUF_HP_AON_POS                                 (8U)
#define AON_XTAL_BUF_HP_AON_LEN                                 (4U)
#define AON_XTAL_BUF_HP_AON_MSK                                 (((1U<<AON_XTAL_BUF_HP_AON_LEN)-1)<<AON_XTAL_BUF_HP_AON_POS)
#define AON_XTAL_BUF_HP_AON_UMSK                                (~(((1U<<AON_XTAL_BUF_HP_AON_LEN)-1)<<AON_XTAL_BUF_HP_AON_POS))
#define AON_XTAL_SLEEP_AON                                      AON_XTAL_SLEEP_AON
#define AON_XTAL_SLEEP_AON_POS                                  (13U)
#define AON_XTAL_SLEEP_AON_LEN                                  (1U)
#define AON_XTAL_SLEEP_AON_MSK                                  (((1U<<AON_XTAL_SLEEP_AON_LEN)-1)<<AON_XTAL_SLEEP_AON_POS)
#define AON_XTAL_SLEEP_AON_UMSK                                 (~(((1U<<AON_XTAL_SLEEP_AON_LEN)-1)<<AON_XTAL_SLEEP_AON_POS))
#define AON_XTAL_HF_RC32M_CODE_AON                              AON_XTAL_HF_RC32M_CODE_AON
#define AON_XTAL_HF_RC32M_CODE_AON_POS                          (16U)
#define AON_XTAL_HF_RC32M_CODE_AON_LEN                          (8U)
#define AON_XTAL_HF_RC32M_CODE_AON_MSK                          (((1U<<AON_XTAL_HF_RC32M_CODE_AON_LEN)-1)<<AON_XTAL_HF_RC32M_CODE_AON_POS)
#define AON_XTAL_HF_RC32M_CODE_AON_UMSK                         (~(((1U<<AON_XTAL_HF_RC32M_CODE_AON_LEN)-1)<<AON_XTAL_HF_RC32M_CODE_AON_POS))
#define AON_XTAL_GM_BOOST_AON                                   AON_XTAL_GM_BOOST_AON
#define AON_XTAL_GM_BOOST_AON_POS                               (28U)
#define AON_XTAL_GM_BOOST_AON_LEN                               (2U)
#define AON_XTAL_GM_BOOST_AON_MSK                               (((1U<<AON_XTAL_GM_BOOST_AON_LEN)-1)<<AON_XTAL_GM_BOOST_AON_POS)
#define AON_XTAL_GM_BOOST_AON_UMSK                              (~(((1U<<AON_XTAL_GM_BOOST_AON_LEN)-1)<<AON_XTAL_GM_BOOST_AON_POS))
#define AON_XTAL_RDY_SEL_AON                                    AON_XTAL_RDY_SEL_AON
#define AON_XTAL_RDY_SEL_AON_POS                                (30U)
#define AON_XTAL_RDY_SEL_AON_LEN                                (2U)
#define AON_XTAL_RDY_SEL_AON_MSK                                (((1U<<AON_XTAL_RDY_SEL_AON_LEN)-1)<<AON_XTAL_RDY_SEL_AON_POS)
#define AON_XTAL_RDY_SEL_AON_UMSK                               (~(((1U<<AON_XTAL_RDY_SEL_AON_LEN)-1)<<AON_XTAL_RDY_SEL_AON_POS))

/* 0x888 : xtal_cfg2 */
#define AON_XTAL_CFG2_OFFSET                                    (0x888)
#define AON_XTAL_HF_CAPCODE_OUT_AON                             AON_XTAL_HF_CAPCODE_OUT_AON
#define AON_XTAL_HF_CAPCODE_OUT_AON_POS                         (0U)
#define AON_XTAL_HF_CAPCODE_OUT_AON_LEN                         (8U)
#define AON_XTAL_HF_CAPCODE_OUT_AON_MSK                         (((1U<<AON_XTAL_HF_CAPCODE_OUT_AON_LEN)-1)<<AON_XTAL_HF_CAPCODE_OUT_AON_POS)
#define AON_XTAL_HF_CAPCODE_OUT_AON_UMSK                        (~(((1U<<AON_XTAL_HF_CAPCODE_OUT_AON_LEN)-1)<<AON_XTAL_HF_CAPCODE_OUT_AON_POS))
#define AON_XTAL_HF_CAPCODE_IN_AON                              AON_XTAL_HF_CAPCODE_IN_AON
#define AON_XTAL_HF_CAPCODE_IN_AON_POS                          (8U)
#define AON_XTAL_HF_CAPCODE_IN_AON_LEN                          (8U)
#define AON_XTAL_HF_CAPCODE_IN_AON_MSK                          (((1U<<AON_XTAL_HF_CAPCODE_IN_AON_LEN)-1)<<AON_XTAL_HF_CAPCODE_IN_AON_POS)
#define AON_XTAL_HF_CAPCODE_IN_AON_UMSK                         (~(((1U<<AON_XTAL_HF_CAPCODE_IN_AON_LEN)-1)<<AON_XTAL_HF_CAPCODE_IN_AON_POS))
#define AON_XTAL_HF_SHORT_FILTER_AON                            AON_XTAL_HF_SHORT_FILTER_AON
#define AON_XTAL_HF_SHORT_FILTER_AON_POS                        (16U)
#define AON_XTAL_HF_SHORT_FILTER_AON_LEN                        (1U)
#define AON_XTAL_HF_SHORT_FILTER_AON_MSK                        (((1U<<AON_XTAL_HF_SHORT_FILTER_AON_LEN)-1)<<AON_XTAL_HF_SHORT_FILTER_AON_POS)
#define AON_XTAL_HF_SHORT_FILTER_AON_UMSK                       (~(((1U<<AON_XTAL_HF_SHORT_FILTER_AON_LEN)-1)<<AON_XTAL_HF_SHORT_FILTER_AON_POS))
#define AON_XTAL_HF_INJECT_EN_AON                               AON_XTAL_HF_INJECT_EN_AON
#define AON_XTAL_HF_INJECT_EN_AON_POS                           (20U)
#define AON_XTAL_HF_INJECT_EN_AON_LEN                           (1U)
#define AON_XTAL_HF_INJECT_EN_AON_MSK                           (((1U<<AON_XTAL_HF_INJECT_EN_AON_LEN)-1)<<AON_XTAL_HF_INJECT_EN_AON_POS)
#define AON_XTAL_HF_INJECT_EN_AON_UMSK                          (~(((1U<<AON_XTAL_HF_INJECT_EN_AON_LEN)-1)<<AON_XTAL_HF_INJECT_EN_AON_POS))
#define AON_XTAL_HF_RC32M_RDY_SEL_AON                           AON_XTAL_HF_RC32M_RDY_SEL_AON
#define AON_XTAL_HF_RC32M_RDY_SEL_AON_POS                       (22U)
#define AON_XTAL_HF_RC32M_RDY_SEL_AON_LEN                       (2U)
#define AON_XTAL_HF_RC32M_RDY_SEL_AON_MSK                       (((1U<<AON_XTAL_HF_RC32M_RDY_SEL_AON_LEN)-1)<<AON_XTAL_HF_RC32M_RDY_SEL_AON_POS)
#define AON_XTAL_HF_RC32M_RDY_SEL_AON_UMSK                      (~(((1U<<AON_XTAL_HF_RC32M_RDY_SEL_AON_LEN)-1)<<AON_XTAL_HF_RC32M_RDY_SEL_AON_POS))
#define AON_XTAL_HF_RC32M_RESV_AON                              AON_XTAL_HF_RC32M_RESV_AON
#define AON_XTAL_HF_RC32M_RESV_AON_POS                          (24U)
#define AON_XTAL_HF_RC32M_RESV_AON_LEN                          (8U)
#define AON_XTAL_HF_RC32M_RESV_AON_MSK                          (((1U<<AON_XTAL_HF_RC32M_RESV_AON_LEN)-1)<<AON_XTAL_HF_RC32M_RESV_AON_POS)
#define AON_XTAL_HF_RC32M_RESV_AON_UMSK                         (~(((1U<<AON_XTAL_HF_RC32M_RESV_AON_LEN)-1)<<AON_XTAL_HF_RC32M_RESV_AON_POS))

/* 0x88C : tsen */
#define AON_TSEN_OFFSET                                         (0x88C)
#define AON_TSEN_REFCODE_CORNER                                 AON_TSEN_REFCODE_CORNER
#define AON_TSEN_REFCODE_CORNER_POS                             (0U)
#define AON_TSEN_REFCODE_CORNER_LEN                             (12U)
#define AON_TSEN_REFCODE_CORNER_MSK                             (((1U<<AON_TSEN_REFCODE_CORNER_LEN)-1)<<AON_TSEN_REFCODE_CORNER_POS)
#define AON_TSEN_REFCODE_CORNER_UMSK                            (~(((1U<<AON_TSEN_REFCODE_CORNER_LEN)-1)<<AON_TSEN_REFCODE_CORNER_POS))
#define AON_TSEN_REFCODE_RFCAL                                  AON_TSEN_REFCODE_RFCAL
#define AON_TSEN_REFCODE_RFCAL_POS                              (16U)
#define AON_TSEN_REFCODE_RFCAL_LEN                              (12U)
#define AON_TSEN_REFCODE_RFCAL_MSK                              (((1U<<AON_TSEN_REFCODE_RFCAL_LEN)-1)<<AON_TSEN_REFCODE_RFCAL_POS)
#define AON_TSEN_REFCODE_RFCAL_UMSK                             (~(((1U<<AON_TSEN_REFCODE_RFCAL_LEN)-1)<<AON_TSEN_REFCODE_RFCAL_POS))
#define AON_XTAL_RDY                                            AON_XTAL_RDY
#define AON_XTAL_RDY_POS                                        (28U)
#define AON_XTAL_RDY_LEN                                        (1U)
#define AON_XTAL_RDY_MSK                                        (((1U<<AON_XTAL_RDY_LEN)-1)<<AON_XTAL_RDY_POS)
#define AON_XTAL_RDY_UMSK                                       (~(((1U<<AON_XTAL_RDY_LEN)-1)<<AON_XTAL_RDY_POS))
#define AON_XTAL_INN_CFG_EN_AON                                 AON_XTAL_INN_CFG_EN_AON
#define AON_XTAL_INN_CFG_EN_AON_POS                             (29U)
#define AON_XTAL_INN_CFG_EN_AON_LEN                             (1U)
#define AON_XTAL_INN_CFG_EN_AON_MSK                             (((1U<<AON_XTAL_INN_CFG_EN_AON_LEN)-1)<<AON_XTAL_INN_CFG_EN_AON_POS)
#define AON_XTAL_INN_CFG_EN_AON_UMSK                            (~(((1U<<AON_XTAL_INN_CFG_EN_AON_LEN)-1)<<AON_XTAL_INN_CFG_EN_AON_POS))
#define AON_XTAL_RDY_INT_SEL_AON                                AON_XTAL_RDY_INT_SEL_AON
#define AON_XTAL_RDY_INT_SEL_AON_POS                            (30U)
#define AON_XTAL_RDY_INT_SEL_AON_LEN                            (2U)
#define AON_XTAL_RDY_INT_SEL_AON_MSK                            (((1U<<AON_XTAL_RDY_INT_SEL_AON_LEN)-1)<<AON_XTAL_RDY_INT_SEL_AON_POS)
#define AON_XTAL_RDY_INT_SEL_AON_UMSK                           (~(((1U<<AON_XTAL_RDY_INT_SEL_AON_LEN)-1)<<AON_XTAL_RDY_INT_SEL_AON_POS))

/* 0x900 : acomp0_ctrl */
#define AON_ACOMP0_CTRL_OFFSET                                  (0x900)
#define AON_ACOMP0_EN                                           AON_ACOMP0_EN
#define AON_ACOMP0_EN_POS                                       (0U)
#define AON_ACOMP0_EN_LEN                                       (1U)
#define AON_ACOMP0_EN_MSK                                       (((1U<<AON_ACOMP0_EN_LEN)-1)<<AON_ACOMP0_EN_POS)
#define AON_ACOMP0_EN_UMSK                                      (~(((1U<<AON_ACOMP0_EN_LEN)-1)<<AON_ACOMP0_EN_POS))
#define AON_ACOMP0_HYST_SELN                                    AON_ACOMP0_HYST_SELN
#define AON_ACOMP0_HYST_SELN_POS                                (4U)
#define AON_ACOMP0_HYST_SELN_LEN                                (3U)
#define AON_ACOMP0_HYST_SELN_MSK                                (((1U<<AON_ACOMP0_HYST_SELN_LEN)-1)<<AON_ACOMP0_HYST_SELN_POS)
#define AON_ACOMP0_HYST_SELN_UMSK                               (~(((1U<<AON_ACOMP0_HYST_SELN_LEN)-1)<<AON_ACOMP0_HYST_SELN_POS))
#define AON_ACOMP0_HYST_SELP                                    AON_ACOMP0_HYST_SELP
#define AON_ACOMP0_HYST_SELP_POS                                (7U)
#define AON_ACOMP0_HYST_SELP_LEN                                (3U)
#define AON_ACOMP0_HYST_SELP_MSK                                (((1U<<AON_ACOMP0_HYST_SELP_LEN)-1)<<AON_ACOMP0_HYST_SELP_POS)
#define AON_ACOMP0_HYST_SELP_UMSK                               (~(((1U<<AON_ACOMP0_HYST_SELP_LEN)-1)<<AON_ACOMP0_HYST_SELP_POS))
#define AON_ACOMP0_BIAS_PROG                                    AON_ACOMP0_BIAS_PROG
#define AON_ACOMP0_BIAS_PROG_POS                                (10U)
#define AON_ACOMP0_BIAS_PROG_LEN                                (2U)
#define AON_ACOMP0_BIAS_PROG_MSK                                (((1U<<AON_ACOMP0_BIAS_PROG_LEN)-1)<<AON_ACOMP0_BIAS_PROG_POS)
#define AON_ACOMP0_BIAS_PROG_UMSK                               (~(((1U<<AON_ACOMP0_BIAS_PROG_LEN)-1)<<AON_ACOMP0_BIAS_PROG_POS))
#define AON_ACOMP0_LEVEL_SEL                                    AON_ACOMP0_LEVEL_SEL
#define AON_ACOMP0_LEVEL_SEL_POS                                (12U)
#define AON_ACOMP0_LEVEL_SEL_LEN                                (6U)
#define AON_ACOMP0_LEVEL_SEL_MSK                                (((1U<<AON_ACOMP0_LEVEL_SEL_LEN)-1)<<AON_ACOMP0_LEVEL_SEL_POS)
#define AON_ACOMP0_LEVEL_SEL_UMSK                               (~(((1U<<AON_ACOMP0_LEVEL_SEL_LEN)-1)<<AON_ACOMP0_LEVEL_SEL_POS))
#define AON_ACOMP0_NEG_SEL                                      AON_ACOMP0_NEG_SEL
#define AON_ACOMP0_NEG_SEL_POS                                  (18U)
#define AON_ACOMP0_NEG_SEL_LEN                                  (4U)
#define AON_ACOMP0_NEG_SEL_MSK                                  (((1U<<AON_ACOMP0_NEG_SEL_LEN)-1)<<AON_ACOMP0_NEG_SEL_POS)
#define AON_ACOMP0_NEG_SEL_UMSK                                 (~(((1U<<AON_ACOMP0_NEG_SEL_LEN)-1)<<AON_ACOMP0_NEG_SEL_POS))
#define AON_ACOMP0_POS_SEL                                      AON_ACOMP0_POS_SEL
#define AON_ACOMP0_POS_SEL_POS                                  (22U)
#define AON_ACOMP0_POS_SEL_LEN                                  (4U)
#define AON_ACOMP0_POS_SEL_MSK                                  (((1U<<AON_ACOMP0_POS_SEL_LEN)-1)<<AON_ACOMP0_POS_SEL_POS)
#define AON_ACOMP0_POS_SEL_UMSK                                 (~(((1U<<AON_ACOMP0_POS_SEL_LEN)-1)<<AON_ACOMP0_POS_SEL_POS))
#define AON_ACOMP0_MUXEN                                        AON_ACOMP0_MUXEN
#define AON_ACOMP0_MUXEN_POS                                    (26U)
#define AON_ACOMP0_MUXEN_LEN                                    (1U)
#define AON_ACOMP0_MUXEN_MSK                                    (((1U<<AON_ACOMP0_MUXEN_LEN)-1)<<AON_ACOMP0_MUXEN_POS)
#define AON_ACOMP0_MUXEN_UMSK                                   (~(((1U<<AON_ACOMP0_MUXEN_LEN)-1)<<AON_ACOMP0_MUXEN_POS))

/* 0x904 : acomp1_ctrl */
#define AON_ACOMP1_CTRL_OFFSET                                  (0x904)
#define AON_ACOMP1_EN                                           AON_ACOMP1_EN
#define AON_ACOMP1_EN_POS                                       (0U)
#define AON_ACOMP1_EN_LEN                                       (1U)
#define AON_ACOMP1_EN_MSK                                       (((1U<<AON_ACOMP1_EN_LEN)-1)<<AON_ACOMP1_EN_POS)
#define AON_ACOMP1_EN_UMSK                                      (~(((1U<<AON_ACOMP1_EN_LEN)-1)<<AON_ACOMP1_EN_POS))
#define AON_ACOMP1_HYST_SELN                                    AON_ACOMP1_HYST_SELN
#define AON_ACOMP1_HYST_SELN_POS                                (4U)
#define AON_ACOMP1_HYST_SELN_LEN                                (3U)
#define AON_ACOMP1_HYST_SELN_MSK                                (((1U<<AON_ACOMP1_HYST_SELN_LEN)-1)<<AON_ACOMP1_HYST_SELN_POS)
#define AON_ACOMP1_HYST_SELN_UMSK                               (~(((1U<<AON_ACOMP1_HYST_SELN_LEN)-1)<<AON_ACOMP1_HYST_SELN_POS))
#define AON_ACOMP1_HYST_SELP                                    AON_ACOMP1_HYST_SELP
#define AON_ACOMP1_HYST_SELP_POS                                (7U)
#define AON_ACOMP1_HYST_SELP_LEN                                (3U)
#define AON_ACOMP1_HYST_SELP_MSK                                (((1U<<AON_ACOMP1_HYST_SELP_LEN)-1)<<AON_ACOMP1_HYST_SELP_POS)
#define AON_ACOMP1_HYST_SELP_UMSK                               (~(((1U<<AON_ACOMP1_HYST_SELP_LEN)-1)<<AON_ACOMP1_HYST_SELP_POS))
#define AON_ACOMP1_BIAS_PROG                                    AON_ACOMP1_BIAS_PROG
#define AON_ACOMP1_BIAS_PROG_POS                                (10U)
#define AON_ACOMP1_BIAS_PROG_LEN                                (2U)
#define AON_ACOMP1_BIAS_PROG_MSK                                (((1U<<AON_ACOMP1_BIAS_PROG_LEN)-1)<<AON_ACOMP1_BIAS_PROG_POS)
#define AON_ACOMP1_BIAS_PROG_UMSK                               (~(((1U<<AON_ACOMP1_BIAS_PROG_LEN)-1)<<AON_ACOMP1_BIAS_PROG_POS))
#define AON_ACOMP1_LEVEL_SEL                                    AON_ACOMP1_LEVEL_SEL
#define AON_ACOMP1_LEVEL_SEL_POS                                (12U)
#define AON_ACOMP1_LEVEL_SEL_LEN                                (6U)
#define AON_ACOMP1_LEVEL_SEL_MSK                                (((1U<<AON_ACOMP1_LEVEL_SEL_LEN)-1)<<AON_ACOMP1_LEVEL_SEL_POS)
#define AON_ACOMP1_LEVEL_SEL_UMSK                               (~(((1U<<AON_ACOMP1_LEVEL_SEL_LEN)-1)<<AON_ACOMP1_LEVEL_SEL_POS))
#define AON_ACOMP1_NEG_SEL                                      AON_ACOMP1_NEG_SEL
#define AON_ACOMP1_NEG_SEL_POS                                  (18U)
#define AON_ACOMP1_NEG_SEL_LEN                                  (4U)
#define AON_ACOMP1_NEG_SEL_MSK                                  (((1U<<AON_ACOMP1_NEG_SEL_LEN)-1)<<AON_ACOMP1_NEG_SEL_POS)
#define AON_ACOMP1_NEG_SEL_UMSK                                 (~(((1U<<AON_ACOMP1_NEG_SEL_LEN)-1)<<AON_ACOMP1_NEG_SEL_POS))
#define AON_ACOMP1_POS_SEL                                      AON_ACOMP1_POS_SEL
#define AON_ACOMP1_POS_SEL_POS                                  (22U)
#define AON_ACOMP1_POS_SEL_LEN                                  (4U)
#define AON_ACOMP1_POS_SEL_MSK                                  (((1U<<AON_ACOMP1_POS_SEL_LEN)-1)<<AON_ACOMP1_POS_SEL_POS)
#define AON_ACOMP1_POS_SEL_UMSK                                 (~(((1U<<AON_ACOMP1_POS_SEL_LEN)-1)<<AON_ACOMP1_POS_SEL_POS))
#define AON_ACOMP1_MUXEN                                        AON_ACOMP1_MUXEN
#define AON_ACOMP1_MUXEN_POS                                    (26U)
#define AON_ACOMP1_MUXEN_LEN                                    (1U)
#define AON_ACOMP1_MUXEN_MSK                                    (((1U<<AON_ACOMP1_MUXEN_LEN)-1)<<AON_ACOMP1_MUXEN_POS)
#define AON_ACOMP1_MUXEN_UMSK                                   (~(((1U<<AON_ACOMP1_MUXEN_LEN)-1)<<AON_ACOMP1_MUXEN_POS))

/* 0x908 : acomp_ctrl */
#define AON_ACOMP_CTRL_OFFSET                                   (0x908)
#define AON_ACOMP1_RSTN_ANA                                     AON_ACOMP1_RSTN_ANA
#define AON_ACOMP1_RSTN_ANA_POS                                 (0U)
#define AON_ACOMP1_RSTN_ANA_LEN                                 (1U)
#define AON_ACOMP1_RSTN_ANA_MSK                                 (((1U<<AON_ACOMP1_RSTN_ANA_LEN)-1)<<AON_ACOMP1_RSTN_ANA_POS)
#define AON_ACOMP1_RSTN_ANA_UMSK                                (~(((1U<<AON_ACOMP1_RSTN_ANA_LEN)-1)<<AON_ACOMP1_RSTN_ANA_POS))
#define AON_ACOMP0_RSTN_ANA                                     AON_ACOMP0_RSTN_ANA
#define AON_ACOMP0_RSTN_ANA_POS                                 (1U)
#define AON_ACOMP0_RSTN_ANA_LEN                                 (1U)
#define AON_ACOMP0_RSTN_ANA_MSK                                 (((1U<<AON_ACOMP0_RSTN_ANA_LEN)-1)<<AON_ACOMP0_RSTN_ANA_POS)
#define AON_ACOMP0_RSTN_ANA_UMSK                                (~(((1U<<AON_ACOMP0_RSTN_ANA_LEN)-1)<<AON_ACOMP0_RSTN_ANA_POS))
#define AON_ACOMP1_TEST_EN                                      AON_ACOMP1_TEST_EN
#define AON_ACOMP1_TEST_EN_POS                                  (8U)
#define AON_ACOMP1_TEST_EN_LEN                                  (1U)
#define AON_ACOMP1_TEST_EN_MSK                                  (((1U<<AON_ACOMP1_TEST_EN_LEN)-1)<<AON_ACOMP1_TEST_EN_POS)
#define AON_ACOMP1_TEST_EN_UMSK                                 (~(((1U<<AON_ACOMP1_TEST_EN_LEN)-1)<<AON_ACOMP1_TEST_EN_POS))
#define AON_ACOMP0_TEST_EN                                      AON_ACOMP0_TEST_EN
#define AON_ACOMP0_TEST_EN_POS                                  (9U)
#define AON_ACOMP0_TEST_EN_LEN                                  (1U)
#define AON_ACOMP0_TEST_EN_MSK                                  (((1U<<AON_ACOMP0_TEST_EN_LEN)-1)<<AON_ACOMP0_TEST_EN_POS)
#define AON_ACOMP0_TEST_EN_UMSK                                 (~(((1U<<AON_ACOMP0_TEST_EN_LEN)-1)<<AON_ACOMP0_TEST_EN_POS))
#define AON_ACOMP1_TEST_SEL                                     AON_ACOMP1_TEST_SEL
#define AON_ACOMP1_TEST_SEL_POS                                 (10U)
#define AON_ACOMP1_TEST_SEL_LEN                                 (2U)
#define AON_ACOMP1_TEST_SEL_MSK                                 (((1U<<AON_ACOMP1_TEST_SEL_LEN)-1)<<AON_ACOMP1_TEST_SEL_POS)
#define AON_ACOMP1_TEST_SEL_UMSK                                (~(((1U<<AON_ACOMP1_TEST_SEL_LEN)-1)<<AON_ACOMP1_TEST_SEL_POS))
#define AON_ACOMP0_TEST_SEL                                     AON_ACOMP0_TEST_SEL
#define AON_ACOMP0_TEST_SEL_POS                                 (12U)
#define AON_ACOMP0_TEST_SEL_LEN                                 (2U)
#define AON_ACOMP0_TEST_SEL_MSK                                 (((1U<<AON_ACOMP0_TEST_SEL_LEN)-1)<<AON_ACOMP0_TEST_SEL_POS)
#define AON_ACOMP0_TEST_SEL_UMSK                                (~(((1U<<AON_ACOMP0_TEST_SEL_LEN)-1)<<AON_ACOMP0_TEST_SEL_POS))
#define AON_ACOMP1_OUT_RAW                                      AON_ACOMP1_OUT_RAW
#define AON_ACOMP1_OUT_RAW_POS                                  (17U)
#define AON_ACOMP1_OUT_RAW_LEN                                  (1U)
#define AON_ACOMP1_OUT_RAW_MSK                                  (((1U<<AON_ACOMP1_OUT_RAW_LEN)-1)<<AON_ACOMP1_OUT_RAW_POS)
#define AON_ACOMP1_OUT_RAW_UMSK                                 (~(((1U<<AON_ACOMP1_OUT_RAW_LEN)-1)<<AON_ACOMP1_OUT_RAW_POS))
#define AON_ACOMP0_OUT_RAW                                      AON_ACOMP0_OUT_RAW
#define AON_ACOMP0_OUT_RAW_POS                                  (19U)
#define AON_ACOMP0_OUT_RAW_LEN                                  (1U)
#define AON_ACOMP0_OUT_RAW_MSK                                  (((1U<<AON_ACOMP0_OUT_RAW_LEN)-1)<<AON_ACOMP0_OUT_RAW_POS)
#define AON_ACOMP0_OUT_RAW_UMSK                                 (~(((1U<<AON_ACOMP0_OUT_RAW_LEN)-1)<<AON_ACOMP0_OUT_RAW_POS))
#define AON_ACOMP_VREF_SEL                                      AON_ACOMP_VREF_SEL
#define AON_ACOMP_VREF_SEL_POS                                  (24U)
#define AON_ACOMP_VREF_SEL_LEN                                  (6U)
#define AON_ACOMP_VREF_SEL_MSK                                  (((1U<<AON_ACOMP_VREF_SEL_LEN)-1)<<AON_ACOMP_VREF_SEL_POS)
#define AON_ACOMP_VREF_SEL_UMSK                                 (~(((1U<<AON_ACOMP_VREF_SEL_LEN)-1)<<AON_ACOMP_VREF_SEL_POS))
#define AON_ACOMP_RESERVED                                      AON_ACOMP_RESERVED
#define AON_ACOMP_RESERVED_POS                                  (30U)
#define AON_ACOMP_RESERVED_LEN                                  (2U)
#define AON_ACOMP_RESERVED_MSK                                  (((1U<<AON_ACOMP_RESERVED_LEN)-1)<<AON_ACOMP_RESERVED_POS)
#define AON_ACOMP_RESERVED_UMSK                                 (~(((1U<<AON_ACOMP_RESERVED_LEN)-1)<<AON_ACOMP_RESERVED_POS))

/* 0x93C : hbncore_resv0 */
#define AON_HBNCORE_RESV0_OFFSET                                (0x93C)
#define AON_HBNCORE_RESV0_DATA                                  AON_HBNCORE_RESV0_DATA
#define AON_HBNCORE_RESV0_DATA_POS                              (0U)
#define AON_HBNCORE_RESV0_DATA_LEN                              (32U)
#define AON_HBNCORE_RESV0_DATA_MSK                              (((1U<<AON_HBNCORE_RESV0_DATA_LEN)-1)<<AON_HBNCORE_RESV0_DATA_POS)
#define AON_HBNCORE_RESV0_DATA_UMSK                             (~(((1U<<AON_HBNCORE_RESV0_DATA_LEN)-1)<<AON_HBNCORE_RESV0_DATA_POS))

/* 0x940 : hbncore_resv1 */
#define AON_HBNCORE_RESV1_OFFSET                                (0x940)
#define AON_HBNCORE_RESV1_DATA                                  AON_HBNCORE_RESV1_DATA
#define AON_HBNCORE_RESV1_DATA_POS                              (0U)
#define AON_HBNCORE_RESV1_DATA_LEN                              (32U)
#define AON_HBNCORE_RESV1_DATA_MSK                              (((1U<<AON_HBNCORE_RESV1_DATA_LEN)-1)<<AON_HBNCORE_RESV1_DATA_POS)
#define AON_HBNCORE_RESV1_DATA_UMSK                             (~(((1U<<AON_HBNCORE_RESV1_DATA_LEN)-1)<<AON_HBNCORE_RESV1_DATA_POS))


struct  aon_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[2048];

