bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/aon_reg.h
    /* 0x800 : aon */
    union {
        struct {
            uint32_t aon_resv                       :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_11                  :  4; /* [11: 8],       rsvd,        0x0 */
            uint32_t pu_aon_dc_tbuf                 :  1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_19                 :  7; /* [19:13],       rsvd,        0x0 */
            uint32_t ldo11_rt_pulldown              :  1; /* [   20],        r/w,        0x0 */
            uint32_t ldo11_rt_pulldown_sel          :  1; /* [   21],        r/w,        0x1 */
            uint32_t sw_pu_ldo11_rt                 :  1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23_31                 :  9; /* [31:23],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } aon;

    /* 0x804 : aon_common */
    union {
        struct {
            uint32_t tmux_aon                       :  3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t ten_aon                        :  1; /* [    4],        r/w,        0x0 */
            uint32_t dten_xtal32k                   :  1; /* [    5],        r/w,        0x0 */
            uint32_t ten_xtal32k                    :  1; /* [    6],        r/w,        0x0 */
            uint32_t pmip_dc_tp_out_en_aon          :  1; /* [    7],        r/w,        0x0 */
            uint32_t reserved_8                     :  1; /* [    8],       rsvd,        0x0 */
            uint32_t ten_ldo11soc_aon               :  1; /* [    9],        r/w,        0x0 */
            uint32_t ten_dcdc_0_aon                 :  1; /* [   10],        r/w,        0x0 */
            uint32_t ten_dcdc_1_aon                 :  1; /* [   11],        r/w,        0x0 */
            uint32_t ten_bg_sys_aon                 :  1; /* [   12],        r/w,        0x0 */
            uint32_t ten_ldo14_aon                  :  1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t ten_xtal_hf_rc32m_aon          :  1; /* [   16],        r/w,        0x0 */
            uint32_t ten_xtal_aon                   :  1; /* [   17],        r/w,        0x0 */
            uint32_t dten_xtal_aon                  :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_30                 : 12; /* [30:19],       rsvd,        0x0 */
            uint32_t avdd14_rdy_aon                 :  1; /* [   31],          r,        0x1 */
        }BF;
        uint32_t WORD;
    } aon_common;

    /* 0x808 : aon_misc */
    union {
        struct {
            uint32_t sw_soc_en_aon                  :  1; /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } aon_misc;

    /* 0x80c  reserved */
    uint8_t RESERVED0x80c[4];

    /* 0x810 : bg_sys_top */
    union {
        struct {
            uint32_t pmip_resv_aon                  :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t pu_bg_sys_aon                  :  1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11                  :  3; /* [11: 9],       rsvd,        0x0 */
            uint32_t bg_sys_start_ctrl_aon          :  1; /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31                 : 19; /* [31:13],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } bg_sys_top;

    /* 0x814 : dcdc18_top_0 */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t dcdc_vout_sel_aon              :  5; /* [ 5: 1],        r/w,        0xb */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t dcdc_vpfm_aon                  :  4; /* [11: 8],        r/w,        0x7 */
            uint32_t dcdc_osc_2m_mode_aon           :  1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t dcdc_osc_freq_trim_aon         :  4; /* [19:16],        r/w,        0x8 */
            uint32_t dcdc_slope_curr_sel_aon        :  5; /* [24:20],        r/w,        0x8 */
            uint32_t dcdc_en_stop_osc_aon           :  1; /* [   25],        r/w,        0x1 */
            uint32_t dcdc_en_slow_osc_aon           :  1; /* [   26],        r/w,        0x0 */
            uint32_t dcdc_osc_inhibit_t2_aon        :  1; /* [   27],        r/w,        0x0 */
            uint32_t dcdc_sstart_time_aon           :  2; /* [29:28],        r/w,        0x1 */
            uint32_t dcdc_dis_aon                   :  1; /* [   30],        r/w,        0x0 */
            uint32_t dcdc_rdy_aon                   :  1; /* [   31],          r,        0x1 */
        }BF;
        uint32_t WORD;
    } dcdc18_top_0;

    /* 0x818 : dcdc18_top_1 */
    union {
        struct {
            uint32_t dcdc_force_en_cs_zvs_aon       :  1; /* [    0],        r/w,        0x0 */
            uint32_t dcdc_cs_delay_aon              :  3; /* [ 3: 1],        r/w,        0x4 */
            uint32_t dcdc_zvs_td_opt_aon            :  3; /* [ 6: 4],        r/w,        0x4 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t dcdc_nonoverlap_td_aon         :  5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t dcdc_rc_sel_aon                :  4; /* [19:16],        r/w,        0x8 */
            uint32_t dcdc_chf_sel_aon               :  4; /* [23:20],        r/w,        0x1 */
            uint32_t dcdc_cfb_sel_aon               :  4; /* [27:24],        r/w,        0x8 */
            uint32_t dcdc_en_antiring_aon           :  1; /* [   28],        r/w,        0x1 */
            uint32_t dcdc_pulldown_aon              :  1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dcdc18_top_1;

    /* 0x81C : dcdc_top_2 */
    union {
        struct {
            uint32_t dcdc_vout_trim_aon             :  4; /* [ 3: 0],        r/w,        0x8 */
            uint32_t dcdc_osc_ss_rstn_aon           :  1; /* [    4],        r/w,        0x0 */
            uint32_t dcdc_osc_ss_en_aon             :  1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t dcdc_osc_ss_period_aon         :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t dcdc_osc_ss_fdev_aon           :  2; /* [11:10],        r/w,        0x0 */
            uint32_t dcdc_comp_gm_sel_aon           :  3; /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t dcdc_isense_trim_aon           :  3; /* [18:16],        r/w,        0x4 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t dcdc_vc_clamp_vth_aon          :  3; /* [22:20],        r/w,        0x4 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t dcdc_ocp_vth_aon               :  3; /* [26:24],        r/w,        0x4 */
            uint32_t dcdc_ocp_rst_aon               :  1; /* [   27],        r/w,        0x0 */
            uint32_t dcdc_ocp_out_aon               :  1; /* [   28],          r,        0x0 */
            uint32_t dcdc_drv_sr_aon                :  2; /* [30:29],        r/w,        0x2 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dcdc_top_2;

    /* 0x820 : ldo11soc_top */
    union {
        struct {
            uint32_t ldo11soc_vout_trim_aon         :  4; /* [ 3: 0],        r/w,        0x8 */
            uint32_t pu_ldo11soc_aon                :  1; /* [    4],        r/w,        0x1 */
            uint32_t ldo11soc_sstart_sel_aon        :  1; /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t ldo11soc_sstart_delay_aon      :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t ldo11soc_pulldown_aon          :  1; /* [   10],        r/w,        0x0 */
            uint32_t ldo11soc_pulldown_sel_aon      :  1; /* [   11],        r/w,        0x1 */
            uint32_t ldo11soc_vth_sel_aon           :  2; /* [13:12],        r/w,        0x1 */
            uint32_t reserved_14_23                 : 10; /* [23:14],       rsvd,        0x0 */
            uint32_t ldo11soc_cc_aon                :  2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_27                 :  2; /* [27:26],       rsvd,        0x0 */
            uint32_t ldo11soc_rdy_aon               :  1; /* [   28],          r,        0x1 */
            uint32_t ldo11soc_power_good_aon        :  1; /* [   29],          r,        0x1 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ldo11soc_top;

    /* 0x824 : ldo14_top */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t ldo14_ocp_th_aon               :  3; /* [ 3: 1],        r/w,        0x5 */
            uint32_t ldo14_ocp_en_aon               :  1; /* [    4],        r/w,        0x1 */
            uint32_t ldo14_ocp_out_aon              :  1; /* [    5],          r,        0x0 */
            uint32_t ldo14_bm_aon                   :  2; /* [ 7: 6],        r/w,        0x1 */
            uint32_t ldo14_sstart_sel_aon           :  1; /* [    8],        r/w,        0x1 */
            uint32_t ldo14_sstart_delay_aon         :  2; /* [10: 9],        r/w,        0x1 */
            uint32_t ldo14_rdy_aon                  :  1; /* [   11],          r,        0x0 */
            uint32_t ldo14_pulldown_aon             :  1; /* [   12],        r/w,        0x0 */
            uint32_t ldo14_pulldown_sel_aon         :  1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t ldo14_vout_sel_aon             :  3; /* [18:16],        r/w,        0x3 */
            uint32_t reserved_19_23                 :  5; /* [23:19],       rsvd,        0x0 */
            uint32_t ldo14_cc_aon                   :  2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26                    :  1; /* [   26],       rsvd,        0x0 */
            uint32_t ldo14_bypass_aon               :  1; /* [   27],        r/w,        0x0 */
            uint32_t ldo14_vout_trim_aon            :  4; /* [31:28],        r/w,        0x8 */
        }BF;
        uint32_t WORD;
    } ldo14_top;

    /* 0x828 : psw_irrcv */
    union {
        struct {
            uint32_t pu_ir_psw_aon                  :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } psw_irrcv;

    /* 0x82c  reserved */
    uint8_t RESERVED0x82c[84];

    /* 0x880 : rf_top_aon */
    union {
        struct {
            uint32_t pu_mbg_aon                     :  1; /* [    0],        r/w,        0x0 */
            uint32_t sw_bz_en_aon                   :  1; /* [    1],        r/w,        0x0 */
            uint32_t pu_sfreg_aon                   :  1; /* [    2],        r/w,        0x0 */
            uint32_t pud_xtal_aon                   :  1; /* [    3],          r,        0x0 */
            uint32_t reserved_4                     :  1; /* [    4],       rsvd,        0x0 */
            uint32_t pu_xtal_aon                    :  1; /* [    5],        r/w,        0x1 */
            uint32_t pu_xtal_hf_rc32m_aon           :  1; /* [    6],        r/w,        0x1 */
            uint32_t pud_xtal_hf_rc32m_aon          :  1; /* [    7],          r,        0x0 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } rf_top_aon;

