bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/aon_reg.h
    /* 0x884 : xtal_cfg */
    union {
        struct {
            uint32_t xtal_bk_aon                    :  2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t xtal_capcode_extra_aon         :  1; /* [    2],        r/w,        0x0 */
            uint32_t xtal_ext_sel_aon               :  1; /* [    3],        r/w,        0x0 */
            uint32_t xtal_buf_en_aon                :  4; /* [ 7: 4],        r/w,        0xf */
            uint32_t xtal_buf_hp_aon                :  4; /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12                    :  1; /* [   12],       rsvd,        0x0 */
            uint32_t xtal_sleep_aon                 :  1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t xtal_hf_rc32m_code_aon         :  8; /* [23:16],        r/w,       0x80 */
            uint32_t reserved_24_27                 :  4; /* [27:24],       rsvd,        0x0 */
            uint32_t xtal_gm_boost_aon              :  2; /* [29:28],        r/w,        0x3 */
            uint32_t xtal_rdy_sel_aon               :  2; /* [31:30],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } xtal_cfg;

    /* 0x888 : xtal_cfg2 */
    union {
        struct {
            uint32_t xtal_hf_capcode_out_aon        :  8; /* [ 7: 0],        r/w,       0x40 */
            uint32_t xtal_hf_capcode_in_aon         :  8; /* [15: 8],        r/w,       0x40 */
            uint32_t xtal_hf_short_filter_aon       :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19                 :  3; /* [19:17],       rsvd,        0x0 */
            uint32_t xtal_hf_inject_en_aon          :  1; /* [   20],        r/w,        0x1 */
            uint32_t reserved_21                    :  1; /* [   21],       rsvd,        0x0 */
            uint32_t xtal_hf_rc32m_rdy_sel_aon      :  2; /* [23:22],        r/w,        0x1 */
            uint32_t xtal_hf_rc32m_resv_aon         :  8; /* [31:24],        r/w,       0x10 */
        }BF;
        uint32_t WORD;
    } xtal_cfg2;

    /* 0x88C : tsen */
    union {
        struct {
            uint32_t tsen_refcode_corner            : 12; /* [11: 0],        r/w,      0x8ff */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t tsen_refcode_rfcal             : 12; /* [27:16],        r/w,      0x8ff */
            uint32_t xtal_rdy                       :  1; /* [   28],          r,        0x1 */
            uint32_t xtal_inn_cfg_en_aon            :  1; /* [   29],        r/w,        0x1 */
            uint32_t xtal_rdy_int_sel_aon           :  2; /* [31:30],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } tsen;

    /* 0x890  reserved */
    uint8_t RESERVED0x890[112];

    /* 0x900 : acomp0_ctrl */
    union {
        struct {
            uint32_t acomp0_en                      :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t acomp0_hyst_seln               :  3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t acomp0_hyst_selp               :  3; /* [ 9: 7],        r/w,        0x0 */
            uint32_t acomp0_bias_prog               :  2; /* [11:10],        r/w,        0x0 */
            uint32_t acomp0_level_sel               :  6; /* [17:12],        r/w,        0x0 */
            uint32_t acomp0_neg_sel                 :  4; /* [21:18],        r/w,        0x0 */
            uint32_t acomp0_pos_sel                 :  4; /* [25:22],        r/w,        0x0 */
            uint32_t acomp0_muxen                   :  1; /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } acomp0_ctrl;

    /* 0x904 : acomp1_ctrl */
    union {
        struct {
            uint32_t acomp1_en                      :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t acomp1_hyst_seln               :  3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t acomp1_hyst_selp               :  3; /* [ 9: 7],        r/w,        0x0 */
            uint32_t acomp1_bias_prog               :  2; /* [11:10],        r/w,        0x0 */
            uint32_t acomp1_level_sel               :  6; /* [17:12],        r/w,        0x0 */
            uint32_t acomp1_neg_sel                 :  4; /* [21:18],        r/w,        0x0 */
            uint32_t acomp1_pos_sel                 :  4; /* [25:22],        r/w,        0x0 */
            uint32_t acomp1_muxen                   :  1; /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } acomp1_ctrl;

    /* 0x908 : acomp_ctrl */
    union {
        struct {
            uint32_t acomp1_rstn_ana                :  1; /* [    0],        r/w,        0x1 */
            uint32_t acomp0_rstn_ana                :  1; /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_7                   :  6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t acomp1_test_en                 :  1; /* [    8],        r/w,        0x0 */
            uint32_t acomp0_test_en                 :  1; /* [    9],        r/w,        0x0 */
            uint32_t acomp1_test_sel                :  2; /* [11:10],        r/w,        0x0 */
            uint32_t acomp0_test_sel                :  2; /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_16                 :  3; /* [16:14],       rsvd,        0x0 */
            uint32_t acomp1_out_raw                 :  1; /* [   17],          r,        0x0 */
            uint32_t reserved_18                    :  1; /* [   18],       rsvd,        0x0 */
            uint32_t acomp0_out_raw                 :  1; /* [   19],          r,        0x0 */
            uint32_t reserved_20_23                 :  4; /* [23:20],       rsvd,        0x0 */
            uint32_t acomp_vref_sel                 :  6; /* [29:24],        r/w,        0x0 */
            uint32_t acomp_reserved                 :  2; /* [31:30],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } acomp_ctrl;

    /* 0x90c  reserved */
    uint8_t RESERVED0x90c[48];

    /* 0x93C : hbncore_resv0 */
    union {
        struct {
            uint32_t hbncore_resv0_data             : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } hbncore_resv0;

    /* 0x940 : hbncore_resv1 */
    union {
        struct {
            uint32_t hbncore_resv1_data             : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } hbncore_resv1;

};

typedef volatile struct aon_reg aon_reg_t;


#endif  /* __AON_REG_H__ */
